RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TCPWM0">
      <name>TCPWM1</name>
      <baseAddress>0x40580000</baseAddress>
    </peripheral>
    <peripheral>
      <name>EVTGEN0</name>
      <description>Event generator</description>
      <headerStructName>EVTGEN</headerStructName>
      <baseAddress>0x403F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>IP enable:
'0': Disabled. All non-retention registers (command and status registers) are reset to their default value when the IP is disabled. All retention registers retain their value when the IP is disabled.
'1': Enabled.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0_STATUS</name>
          <description>Comparator structures comparator 0 status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COMP0_OUT</name>
              <description>Active comparator 'comp0_out[]' outputs.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP1_STATUS</name>
          <description>Comparator structures comparator 1 status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COMP1_OUT</name>
              <description>DeepSleep comparator 'comp1_out_lf[]' outputs (synchronized from clk_lf to the IP clock).</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNTER_STATUS</name>
          <description>Counter status</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>VALID</name>
              <description>Active counter validity:
'0': Invalid.
'1': Valid.

The COUNTER register field INT32 is only valid when VALID is '1'. 

The COUNTER_STATUS and COUNTER registers are non-retention registers; i.e. the COUNTER_STATUS and COUNTER registers are reset during DeepSleep power mode. After entering the Active power mode, the Active counter is initialized with the DeepSleep counter. This initialization may take up to 1 clk_lf cycle.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNTER</name>
          <description>Counter</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INT32</name>
              <description>Active counter 'counter_int[31:0]' on clk_ref_div.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RATIO_CTL</name>
          <description>Ratio control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0070000</resetMask>
          <fields>
            <field>
              <name>DYNAMIC_MODE</name>
              <description>Weighted average calculation (only used when DYNAMIC is '1'):
'0': new RATIO value = (RATIO + measurement + 1) / 2.
'1': new RATIO value = (3*RATIO + measurement + 2) / 4.
'2': new RATIO value = (7*RATIO + measurement + 4) / 8.
'3': new RATIO value = (15*RATIO + measurement + 8) / 16.
'4': new RATIO value = (31*RATIO + measurement + 16) / 32.
'5': new RATIO value = (63*RATIO + measurement + 32) / 64.
'6': new RATIO value = (127*RATIO + measurement + 64) / 128.
'7': new RATIO value = (255*RATIO + measurement + 128) / 256.

Note: 'measurement' (integer component only) is defined as: 256 * 'number of measured clk_ref_div cycles per clk_lf cycle'. The RATIO value (integer and fractional component) is defined as: 256*RATIO.INT16 + RATIO.FRAC8 (RATIO.INT16 = RATIO &gt;&gt; 8 and RATIO.FRAC8 = RATIO  percent 256).</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DYNAMIC</name>
              <description>Specifies if RATIO_CTL.VALID and RATIO are under SW or HW control:
'0': SW control.
'1: HW control. Auto calibration is used to derive the RATIO value. HW measures the number of clk_ref_div cycles per clk_lf cycle. This measurement is combined with the current ratio value to calculate a new ratio value.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Ratio value valid:
'0': Invalid.
'1': Valid.

