RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
          <register>
            <name>CQTERRI</name>
            <description>CQ Task Error Information register</description>
            <addressOffset>0x1D4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x9F3F9F3F</resetMask>
            <fields>
              <field>
                <name>RESP_ERR_CMD_INDX</name>
                <description>This field captures the index of the command that was
executed on the command line when the error occurred.</description>
                <bitRange>[5:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RESP_ERR_TASKID</name>
                <description>This field captures the ID of the task which was executed on
the command line when the error occurred.</description>
                <bitRange>[12:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RESP_ERR_FIELDS_VALID</name>
                <description>This bit is updated when an error is detected while a
command transaction was in progress.
Values:
- 0x1 (SET): Response-related error is detected. Check
contents of RESP_ERR_TASKID and
RESP_ERR_CMD_INDX fields
- 0x0 (NOT_SET): Ignore contents of RESP_ERR_TASKID
and RESP_ERR_CMD_INDX</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TRANS_ERR_CMD_INDX</name>
                <description>This field captures the index of the command that was
executed and whose data transfer has errors.</description>
                <bitRange>[21:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TRANS_ERR_TASKID</name>
                <description>This field captures the ID of the task that was executed and
whose data transfer has errors.</description>
                <bitRange>[28:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TRANS_ERR_FIELDS_VALID</name>
                <description>This bit is updated when an error is detected while a data
transfer transaction was in progress.
Values:
- 0x1 (SET): data transfer related error detected. Check
contents of TRANS_ERR_TASKID and
TRANS_ERR_CMD_INDX fields
- 0x0 (NOT_SET): Ignore contents of
TRANS_ERR_TASKID and TRANS_ERR_CMD_INDX</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCRI</name>
            <description>CQ Command response index</description>
            <addressOffset>0x1D8</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>CMD_RESP_INDX</name>
                <description>Last Command Response index
This field stores the index of the last received command
response. Controller updates the value every time a
command response is received.</description>
                <bitRange>[5:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCRA</name>
            <description>CQ Command response argument register</description>
            <addressOffset>0x1DC</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_RESP_ARG</name>
                <description>Last Command Response argument
This field stores the argument of the last received command
response. Controller updates the value every time a
command response is received.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MSHC_VER_ID_R</name>
            <description>MSHC version</description>
            <addressOffset>0x500</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x3137302A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MSHC_VER_ID</name>
                <description>Current release number
This field indicates the Synopsys DesignWare Cores
DWC_mshc/DWC_mshc_lite current release number that is
read by an application.
For example, release number '1.60a' is represented in
ASCII as 0x313630. Lower 8 bits read from this register can
be ignored by the application.
An application reading this register in conjunction with the
MSHC_VER_TYPE_R register, gathers details of the current
release.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MSHC_VER_TYPE_R</name>
            <description>MSHC version type</description>
            <addressOffset>0x504</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x67612A2A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MSHC_VER_TYPE</name>
                <description>Current release type
This field indicates the Synopsys DesignWare Cores
DWC_mshc/DWC_mshc_lite current release type that is
read by an application.
For example, release type is 'ga' is represented in ASCII as
0x6761. Lower 16 bits read from this register can be ignored
by the application.
An application reading this register in conjunction with the
MSHC_VER_ID_R register, gathers details of the current
release.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MSHC_CTRL_R</name>
            <description>MSHC Control register</description>
            <addressOffset>0x508</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x1</resetValue>
            <resetMask>0x11</resetMask>
            <fields>
              <field>
                <name>CMD_CONFLICT_CHECK</name>
                <description>Command conflict check
This bit enables command conflict check.
Note: DWC_mshc controller monitors the CMD line
whenever a command is issued and checks whether the
value driven on sd_cmd_out matches the value on
sd_cmd_in at next subsequent edge of cclk_tx to determine
command conflict error. This bit is cleared only if the feed
back delay (including IO Pad delay) is more than
(t_card_clk_period - t_setup), where t_setup is the setup
time of a flop in DWC_mshc. The I/O pad delay is consistent
across CMD and DATA lines, and it is within the value:
(2*t_card_clk_period - t_setup)
Values:
- 0x0 (DISABLE_CMD_CONFLICT_CHK): Disable
command conflict check
- 0x1 (CMD_CONFLICT_CHK_LAT1): Check for command
conflict after 1 card clock cycle</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SW_CG_DIS</name>
                <description>Internal clock gating disable control
This bit must be used to disable IP's internal clock gating
when required. when disabled clocks are not gated. Clocks
to the core (except hclk) must be stopped when
programming this bit.
Values:
- 0x0 (ENABLE): Internal clock gates are active and clock
gating is controlled internally
- 0x1 (DISABLE): Internal clock gating is disabled, clocks
are not gated internally</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MBIU_CTRL_R</name>
            <description>MBIU Control register</description>
            <addressOffset>0x510</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x1</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>UNDEFL_INCR_EN</name>
                <description>Undefined INCR Burst
Controls generation of undefined length INCR transfer on
Master interface.
Values:
- 0x0 (FALSE): Undefined INCR type burst is the least
preferred burst on AHB Master I/F
- 0x1 (TRUE): Undefined INCR type burst is the most
preferred burst on AHB Master I/F</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST_INCR4_EN</name>
                <description>INCR4 Burst
Controls generation of INCR4 transfers on Master interface.
Values:
- 0x0 (FALSE): AHB INCR4 burst type is not generated on
Master I/F
- 0x1 (TRUE): AHB INCR4 burst type can be generated on
Master I/F</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST_INCR8_EN</name>
                <description>INCR8 Burst
Controls generation of INCR8 transfers on Master interface.
Values:
- 0x0 (FALSE): AHB INCR8 burst type is not generated on
Master I/F
- 0x1 (TRUE): AHB INCR8 burst type can be generated on
Master I/F</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST_INCR16_EN</name>
                <description>INCR16 Burst
Controls generation of INCR16 transfers on Master
interface.
Values:
- 0x0 (FALSE): AHB INCR16 burst type is not generated on
Master I/F
- 0x1 (TRUE): AHB INCR16 burst type can be generated
on Master I/F</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EMMC_CTRL_R</name>
            <description>eMMC Control register</description>
            <addressOffset>0x52C</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0xC</resetValue>
            <resetMask>0x60F</resetMask>
            <fields>
              <field>
                <name>CARD_IS_EMMC</name>
                <description>eMMC Card present
This bit indicates the type of card connected. An application
program this bit based on the card connected to SDHC.
Values:
- 0x1 (EMMC_CARD): Card connected to SDHC is an
eMMC card
- 0x0 (NON_EMMC_CARD): Card connected to SDHC is
a non-eMMC card</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DISABLE_DATA_CRC_CHK</name>
                <description>Disable Data CRC Check
This bit controls masking of CRC16 error for Card Write in
eMMC mode. This is useful in bus testing (CMD19) for an
eMMC device. In bus testing, an eMMC card does not send
CRC status for a block, which may generate CRC error. This
CRC error can be masked using this bit during bus testing.
Values:
- 0x1 (DISABLE): DATA CRC check is disabled
- 0x0 (ENABLE): DATA CRC check is enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EMMC_RST_N</name>
                <description>EMMC Device Reset signal control.
This register field controls the card_emmc_reset_n output of SDHC
Values:
- 0x1 (RST_DEASSERT): Reset to eMMC device is
deasserted
- 0x0 (RST_ASSERT): Reset to eMMC device asserted
(active low)</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EMMC_RST_N_OE</name>
                <description>Output Enable (OE) control for EMMC Device Reset signal (card_emmc_reset_n).
Values:
- 0x1 (ENABLE): OE for card_emmc_reset_n is 1
- 0x0 (DISABLE): OE for card_emmc_reset_n is 0</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CQE_ALGO_SEL</name>
                <description>Scheduler algorithm selected for execution
This bit selects the Algorithm used for selecting one of the
many ready tasks for execution.
Values:
- 0x0 (PRI_REORDER_PLUS_FCFS): Priority based
reordering with FCFS to resolve equal priority tasks
- 0x1 (FCFS_ONLY): First come First serve, in the order of
DBR rings</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CQE_PREFETCH_DISABLE</name>
                <description>Enable or Disable CQE's PREFETCH feature
This field allows Software to disable CQE's data prefetch
feature when set to 1.
Values:
- 0x0 (PREFETCH_ENABLE): CQE can Prefetch data for
sucessive WRITE transfers and pipeline sucessive READ
transfers
- 0x1 (PREFETCH_DISABLE): Prefetch for WRITE and
Pipeline for READ are disabled</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BOOT_CTRL_R</name>
            <description>eMMC Boot Control register</description>
            <addressOffset>0x52E</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF181</resetMask>
            <fields>
              <field>
                <name>MAN_BOOT_EN</name>
                <description>Mandatory Boot Enable
This bit is used to initiate the mandatory boot operation. The
application sets this bit along with VALIDATE_BOOT bit.
Writing 0 is ignored. The SDHC clears this bit after the
boot transfer is completed or terminated.
Values:
- 0x1 (MAN_BOOT_EN): Mandatory boot enable
- 0x0 (MAN_BOOT_DIS): Mandatory boot disable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VALIDATE_BOOT</name>
                <description>Validate Mandatory Boot Enable bit
This bit is used to validate the MAN_BOOT_EN bit.
Values:
- 0x1 (TRUE): Validate Mandatory boot enable bit
- 0x0 (FALSE): Ignore Mandatory boot Enable bit</description>
                <bitRange>[7:7]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>BOOT_ACK_ENABLE</name>
                <description>Boot Acknowledge Enable
When this bit set, SDHC checks for boot acknowledge
start pattern of 0-1-0 during boot operation. This bit is
applicable for both mandatory and alternate boot mode.
Values:
- 0x1 (TRUE): Boot Ack enable
- 0x0 (FALSE): Boot Ack disable</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BOOT_TOUT_CNT</name>
                <description>N/A</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GP_IN_R</name>
            <description>General Purpose Input register</description>
            <addressOffset>0x530</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>GP_IN</name>
                <description>It reflects the value of gp_in ports.
NOT USED - ALWAYS READS 0</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GP_OUT_R</name>
            <description>General Purpose Output register</description>
            <addressOffset>0x534</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>CARD_DETECT_EN</name>
                <description>0: Force card_detect_n input to 0
1:  Normal card_detect_n operation allowing card detection from a device pin</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_MECH_WRITE_PROT_EN</name>
                <description>card_mech_write_prot, despite its name, is an active low signal (per the SD Host Controller Standard spec it is officially called SDWP#).  Consider that in the following:
0: Force card_mech_write_prot input to 0 internally; this forces write protection to be active
1: Allow card_mech_write_prot to work normally per the device's pin state</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LED_CTRL_OE</name>
                <description>Active high output enable for the LED output signal (led_ctrl) controlled through HOST_CTRL1_R.LED_CTRL:
0: disable OE associated with the led_ctrl output
1: enable OE associated with the led_ctrl output</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_CLOCK_OE</name>
                <description>Active high output enable for the card clock output (clk_card) which is gated by CLK_CTRL_R.SD_CLK_EN:
0: disable OE to the clk_card output
1: enable OE to the clk_card output</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_IF_PWR_EN_OE</name>
                <description>Active high output enable for the card interface power enable output (card_if_pwr_en) controlled through PWR_CTRL_R.SD_BUS_PWR_VDD1:
0: disable OE to the card_if_pwr_en output
1: enable OE to the card_if_pwr_en output</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IO_VOLT_SEL_OE</name>
                <description>Active high output enable for the IO voltage selection signal (io_volt_sel) controlled through HOST_CTRL_2.SIGNALING_EN:
0: disable OE to the io_volt_sel output
1: enable OE to the io_volt_sel output</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_CLOCK_OUT_DLY</name>
                <description>N/A</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_CLOCK_IN_DLY</name>
                <description>Delay CARD_CLOCK input internally to optimally sample CMD/DAT; set according to interface mode:
00: SD Default Speed, SD SDR12, eMMC Legacy
01: SD SDR25, SD SDR50
10: SD High Speed, eMMC High Speed SDR
11: SD DDR50, eMMC DDR</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
