RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETH0</name>
      <description>Ethernet Interface</description>
      <headerStructName>ETH</headerStructName>
      <baseAddress>0x40480000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>MXETH Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8000FF07</resetMask>
          <fields>
            <field>
              <name>ETH_MODE</name>
              <description>Set ethernet mode. The speed of 10M/100M/1G is selected by programming network_config after IP is enabled.
The field also specifies the clock source of internal tx_clk and rx_clk domain.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MII</name>
                  <description>MII mode (10/100MHz speed is determined by network_config[0]).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GMII</name>
                  <description>GMII mode (network_config[10] must be set to enable 1G operation).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGMII</name>
                  <description>RGMII mode (10M/100M/1G speed is determined by network_config[10] and network_config[0]).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMII</name>
                  <description>RMII mode (10M/100M speed is determined by network_config[0]).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFCLK_SRC_SEL</name>
              <description>Select the source for ref_clk.
0: Ref_clk comes from REF_CLK_IN input port (HSIO).
1: Ref_clk comes from REF_CLK_INT_IN input port (PLL).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFCLK_DIV</name>
              <description>Specify the ref_clk divider. Integer division by (1+REFCLK_DIV). Allows for integer divisions in the range [1, 256].</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>MXETH enable:
'0': Disabled.
'1': Enabled.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>MXETH Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF01</resetMask>
          <fields>
            <field>
              <name>PFC_NEGOTIATE</name>
              <description>Identifies that PFC priority based pause flow control 
has been negotiated.
0  - No PFC priority based pause frames have yet 
been received, flow control is being handled using 
classic 802.3 pause frames.
1  - At least one PFC priority based pause frames 
has been received. All subsequent 802.3 pause 
frames will be dropped.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PFC_PAUSED</name>
              <description>Each bit corresponds to a priority indicated within the PFC priority based pause frame.
Each bit is set when a PFC priority based pause frame has been received, and the associated priority pause time quantum is non-zero. Each bit is cleared when the associated pause time identified by the received pause time quantum has elapsed.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NETWORK_CONTROL</name>
          <description>The network control register contains general MAC control functions for both receiver and transmitter.</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOOPBACK</name>
              <description>Loopback - controls the loopback output pin.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPBACK_LOCAL</name>
              <description>Loopback local - asserts the loopback_local signal to the system clock generator. Also connects txd to rxd, tx_en to rx_dv and forces full duplex mode. Bit 11 of the network configuration register must be set low to disable TBI mode when in internal loopback. rx_clk and tx_clk may malfunction as the GEM is switched into and out of internal loopback. It is important that receive and transmit circuits have already been disabled when making the switch into and out of internal loopback. Local loopback functionality is optional and may not be supported by some instantiations of the GEM.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_RECEIVE</name>
              <description>Receive enable - when set, it enables the GEM to receive data. When reset frame reception will stop immediately and the receive pipeline will be cleared. The receive queue pointer register is unaffected.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT</name>
              <description>Transmit enable - when set, it enables the GEM transmitter to send data. When reset transmission will stop immediately, the transmit pipeline and control registers will be cleared and the transmit queue pointer register will reset to point to the start of the transmit descriptor list.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_PORT_EN</name>
              <description>Management port enable - set to one to enable the management port. When zero forces mdio to high impedance state and mdc low.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLEAR_ALL_STATS_REGS</name>
              <description>Clear statistics registers - this bit is write only. Writing a one clears the statistics registers. Self clearing register.</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INC_ALL_STATS_REGS</name>
              <description>Incremental statistics registers - this bit is write only. Writing a one increments all the statistics registers by one for test purposes. Self clearing register.</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>STATS_WRITE_EN</name>
              <description>Write enable for statistics registers - setting this bit to one means the statistics registers can be written for functional test purposes.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK_PRESSURE</name>
              <description>Back pressure if set in 10M or 100M half duplex mode will force collisions on all received frames. Ignored in gigabit half duplex mode.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_START_PCLK</name>
              <description>Start transmission - writing one to this bit starts transmission.</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_HALT_PCLK</name>
              <description>Transmit halt - writing one to this bit halts transmission as soon as any ongoing frame transmission ends.</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_PAUSE_FRAME_REQ</name>
              <description>Transmit pause frame - writing one to this bit causes a pause frame to be transmitted. Self clearing register.</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_PAUSE_FRAME_ZERO</name>
              <description>Transmit zero quantum pause frame - writing one to this bit causes a pause frame with zero quantum to be transmitted.</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>REMOVED_13</name>
              <description>Write ignore, read 0</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_14</name>
              <description>Write ignore, read 0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STORE_RX_TS</name>
              <description>Store receive time stamp to memory. Setting this bit to one will cause the CRC of every received frame to be replaced with the value of the nanoseconds field of the 1588 timer that was captured as the receive frame passed the message time stamp point. Set to zero for normal operation.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFC_ENABLE</name>
              <description>Enable PFC Priority Based Pause Reception capabilities. Setting this bit will enable PFC negotiation and recognition of priority based pause frames.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANSMIT_PFC_PRIORITY_BASED_PAUSE_FRAME</name>
              <description>Write a one to transmit PFC priority based pause frame. Takes the values stored in the Transmit PFC Pause Register. Self clearing register.</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FLUSH_RX_PKT_PCLK</name>
              <description>Flush the next packet from the external RX DPRAM. Writing one to this bit will only have an effect if the DMA is not currently writing a packet already stored in the DPRAM to memory. Self clearing register.</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_LPI_EN</name>
              <description>Enable LPI transmission when set LPI (low power idle) is immediately transmitted. LPI is transmitted even if bit 3 transmit enable is disabled. Setting this bit also sends a pause signal to the transmit datapath.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTP_UNICAST_ENA</name>
              <description>Enable detection of unicast PTP unicast frames.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALT_SGMII_MODE</name>
              <description>Alternative sgmii mode. If asserted with sgmii_mode in the network control register the ACK bit is driven before ability detect during transfer of status information from the PHY to the MAC.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STORE_UDP_OFFSET</name>
              <description>N/A</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_TSU_PORT_ENABLE</name>
              <description>Write ignore, read 0</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ONE_STEP_SYNC_MODE</name>
              <description>1588 One Step Sync Mode. Write 1 to enable. Replace timestamp field in the 1588 header for TX Sync Frames with current TSU timer value.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFC_CTRL</name>
              <description>'Enable multiple PFC pause quantums, one per pause priority'</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_RXQ_SEL_EN</name>
              <description>Enable external selection of receive queue. When this bit is high the ext_match1, ext_match2, ext_match3 and ext_match4 inputs will determine which receive queue a frame is routed to. This will be the case regardless of the state of the external address match
enable bit 9 of the network config register. Note that receive frames will be dropped unless they are matched by the internal frame filtering functionality. If the external address match enable bit 9 in the network config register is set frames may be matched by an
external address match filter as long as one of the ext_match1, ext_match2, ext_match3 and ext_match4 inputs is asserted early enough. When set ext_rxq_sel_en takes precedence over the existing screener functionality. This bit is only relevant if priority
queuing is configured.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSS_CORRECTION_FIELD</name>
              <description>1588 One Step Correction Field Update. Set this bit
high to enable updating the correction field of PTP
1588 version 2 sync frames by adding current TSU
timer value.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_MII_ON_RGMII</name>
              <description>If the RGMII interface being used set this bit high to
configure the interface for MII operation.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TWO_PT_FIVE_GIG</name>
              <description>2.5G operation selected - setting this bit high drives
the speed_mode[3] top level output pin high and also
adjusts the link timer in the PCS auto-negotiation block
to ensure it delivers 10ms for 2500BASE-X and 1.6ms
in SGMII mode, and also ensures int_moderation
counts 800ns periods with the speeded up MAC
clocks.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IFG_EATS_QAV_CREDIT</name>
              <description>Setting this bit high modifies the CBS algorithm so the
IFG/IPG associated with a transmit frame counts
towards its 802.1Qav credit.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_RXQ_RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
