RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>INT_MASK</name>
          <description>The interrupt mask register is a read only register indicating which interrupts are masked. All bits are set at reset and can be reset individually by writing to the interrupt enable register or set individually by writing to the interrupt disable register. Having separate address locations for enable and disable saves the need for performing a read modify write when updating the interrupt mask register. For test purposes there is a write-only function to this register that allows the bits in the interrupt status register to be set or cleared, regardless of the state of the mask register.</description>
          <addressOffset>0x1030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3FFFFFFF</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>MANAGEMENT_DONE_INTERRUPT_MASK</name>
              <description>management done interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RECEIVE_COMPLETE_INTERRUPT_MASK</name>
              <description>receive complete interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RECEIVE_USED_BIT_READ_INTERRUPT_MASK</name>
              <description>receive used bit read interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANSMIT_USED_BIT_READ_INTERRUPT_MASK</name>
              <description>transmit used bit read interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT_MASK</name>
              <description>transmit buffer under run interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_MASK</name>
              <description>A read of this register returns the value of the retry limit exceeded or late collision (gigabit mode only) interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AMBA_ERROR_INTERRUPT_MASK</name>
              <description>transmit frame corruption due to AMBA (AXI) error interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANSMIT_COMPLETE_INTERRUPT_MASK</name>
              <description>transmit complete interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UNUSED_8</name>
              <description>Not used</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UNUSED_9</name>
              <description>Not used</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RECEIVE_OVERRUN_INTERRUPT_MASK</name>
              <description>receive overrun interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_NOT_OK_INTERRUPT_MASK</name>
              <description>bresp not OK interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT_MASK</name>
              <description>pause frame with non-zero pause quantum interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PAUSE_TIME_ZERO_INTERRUPT_MASK</name>
              <description>pause time zero interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PAUSE_FRAME_TRANSMITTED_INTERRUPT_MASK</name>
              <description>pause frame transmitted interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UNUSED_15</name>
              <description>Not used</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UNUSED_16</name>
              <description>Not used</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UNUSED_17</name>
              <description>Not used</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_DELAY_REQ_FRAME_RECEIVED_MASK</name>
              <description>A read of this register returns the value of the PTP delay_req frame received mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_SYNC_FRAME_RECEIVED_MASK</name>
              <description>A read of this register returns the value of the PTP sync frame received mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_DELAY_REQ_FRAME_TRANSMITTED_MASK</name>
              <description>A read of this register returns the value of the PTP delay_req frame transmitted mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_SYNC_FRAME_TRANSMITTED_MASK</name>
              <description>A read of this register returns the value of the PTP sync frame transmitted mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_PDELAY_REQ_FRAME_RECEIVED_MASK</name>
              <description>A read of this register returns the value of the PTP pdelay_req frame received mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_PDELAY_RESP_FRAME_RECEIVED_MASK</name>
              <description>A read of this register returns the value of the PTP pdelay_resp frame received mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_PDELAY_REQ_FRAME_TRANSMITTED_MASK</name>
              <description>A read of this register returns the value of the PTP pdelay_req frame transmitted mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PTP_PDELAY_RESP_FRAME_TRANSMITTED_MASK</name>
              <description>A read of this register returns the value of the PTP pdelay_resp frame transmitted mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSU_SECONDS_REGISTER_INCREMENT_MASK</name>
              <description>A read of this register returns the value of the TSU seconds register increment mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_LPI_INDICATION_MASK</name>
              <description>A read of this register returns the value of the RX LPI indication mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UNUSED_28</name>
              <description>unused</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSU_TIMER_COMPARISON_MASK</name>
              <description>Enable TSU timer comparison interrupt mask.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_MANAGEMENT</name>
          <description>The PHY maintenance register is implemented as a shift register. Writing to the register starts a shift operation which is signalled as complete when bit-2 is set in the network status register. It takes about 2000 pclk cycles to complete, when MDC is set for pclk divide by 32 in the network configuration register. An interrupt is generated upon completion. During this time, the MSB of the register is output on the MDIO pin and the LSB updated from the MDIO pin with each MDC cycle. This causes transmission of a PHY management frame on MDIO. See Section 22.2.4.5 of the IEEE 802.3 standard. Reading during the shift operation will return the current contents of the shift register. At the end of management operation, the bits will have shifted back to their original locations. For a read operation, the data bits will be updated with data read from the PHY. It is important to write the correct values to the register to ensure a valid PHY management frame is produced. The MDIO interface can read IEEE 802.3 clause 45 PHYs as well as clause 22 PHYs. To read clause 45 PHYs, bit 30 should be written with a 0 rather than a 1. For a description of MDC generation, see Network Configuration Register.</description>
          <addressOffset>0x1034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHY_WRITE_READ_DATA</name>
              <description>For a write operation this is written with the data to be written to the PHY. After a read operation this contains the data read from the PHY.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE10</name>
              <description>Must be written with 10.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REGISTER_ADDRESS</name>
              <description>Register address - specifies the register in the PHY to access.</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_ADDRESS</name>
              <description>PHY address.</description>
              <bitRange>[27:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OPERATION</name>
              <description>Operation. For a Clause 45 frame: 00 is an addr, 01 is a write, 10 is a post read increment, 11 is a read frame. For a Clause 22 frame: 10 is a read, 01 is a write.</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE1</name>
              <description>Must be written to 1 for a valid Clause 22 frame and to 0 for a valid Clause 45 frame.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE0</name>
              <description>Must be written with 0.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUSE_TIME</name>
          <description>Received Pause Quantum Register</description>
          <addressOffset>0x1038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>QUANTUM</name>
              <description>Received pause quantum - stores the current value of the received pause quantum register which is decremented every 512 bit times.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PAUSE_QUANTUM</name>
          <description>Transmit Pause Quantum Register</description>
          <addressOffset>0x103C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUANTUM</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QUANTUM_P1</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 1.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBUF_TXCUTTHRU</name>
          <description>Partial store and forward is only applicable when using the DMA configured in SRAM based packet buffer mode. It is also not available when using multi buffer frames. TX Partial Store and Forward</description>
          <addressOffset>0x1040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0x800001FF</resetMask>
          <fields>
            <field>
              <name>DMA_TX_CUTTHRU_THRESHOLD</name>
              <description>Watermark value. This value must be &gt;= 0x9. The reset value depends on the value of the configuration option `gem_tx_pbuf_addr, which is defined in the verilog defs configuration file. The value chosen for the generation of the userguide was `gem_tx_pbuf_addr = 9</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_CUTTHRU</name>
              <description>Enable TX partial store and forward operation</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBUF_RXCUTTHRU</name>
          <description>RX Partial Store and Forward</description>
          <addressOffset>0x1044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0x800000FF</resetMask>
          <fields>
            <field>
              <name>DMA_RX_CUTTHRU_THRESHOLD</name>
              <description>Watermark value. The reset value depends on the value of the configuration option `gem_rx_pbuf_addr, which is defined in the verilog defs configuration file. The value chosen for the generation of the userguide was `gem_rx_pbuf_addr = 8.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_CUTTHRU</name>
              <description>Enable RX partial store and forward operation</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JUMBO_MAX_LENGTH</name>
          <description>Maximum Jumbo Frame Size.</description>
          <addressOffset>0x1048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600</resetValue>
          <resetMask>0x3FFF</resetMask>
          <fields>
            <field>
              <name>JUMBO_MAX_LENGTH</name>
              <description>Maximum Jumbo Frame Size - resets to the gem_jumbo_max_length define value.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTERNAL_FIFO_INTERFACE</name>
          <description>Not presents.</description>
          <addressOffset>0x104C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
