RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>TSU_PEER_RX_SEC</name>
          <description>PTP Peer Event Frame Received Seconds Register (31 to 0 bits)</description>
          <addressOffset>0x11F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMER_PEER_SEC</name>
              <description>PTP Peer Event Frame Received Seconds. The register is updated with the value that the 1588 timer seconds register held when the SFD of a PTP receive peer event crosses the MII interface. The actual update occurs when the GEM recognizes the frame as a PTP pdelay_req or pdelay_resp frame. An interrupt is issued when the register is updated.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSU_PEER_RX_NSEC</name>
          <description>PTP Peer Event Frame Received Nanoseconds Register</description>
          <addressOffset>0x11FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMER_PEER_NSEC</name>
              <description>PTP Peer Event Frame Received Nanoseconds. The register is updated with the value that the 1588 timer nanoseconds register held when the SFD of a PTP receive peer event crosses the MII interface. The actual update occurs when the GEM recognizes the frame as a PTP pdelay_req or pdelay_resp frame. An interrupt is issued when the register is updated.</description>
              <bitRange>[29:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_CONTROL</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x1200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_STATUS</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x1204</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_AN_ADV</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x1210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_AN_LP_BASE</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x1214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_AN_EXP</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x1218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_AN_NP_TX</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x121C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_AN_LP_NP</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x1220</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCS_AN_EXT_STATUS</name>
          <description>Not presents. Access to the register returns AHB error.</description>
          <addressOffset>0x123C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PAUSE_QUANTUM1</name>
          <description>Transmit Pause Quantum Register 1</description>
          <addressOffset>0x1260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUANTUM_P2</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 2.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QUANTUM_P3</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 3.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PAUSE_QUANTUM2</name>
          <description>Transmit Pause Quantum Register 2</description>
          <addressOffset>0x1264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUANTUM_P4</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 4.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QUANTUM_P5</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 5.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PAUSE_QUANTUM3</name>
          <description>Transmit Pause Quantum Register 3</description>
          <addressOffset>0x1268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUANTUM_P6</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 6.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QUANTUM_P7</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 7.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_LPI</name>
          <description>Received LPI transitions</description>
          <addressOffset>0x1270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COUNT_LPI</name>
              <description>Count of RX LPI transitions. A count of the number of times there is a transition from receiving normal idle to receiving low power idle. Cleared on read.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_LPI_TIME</name>
          <description>Received LPI time</description>
          <addressOffset>0x1274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI_TIME</name>
              <description>Time in LPI. This register increments once every 16 pclk cycles when the LPI indication bit 20 is set in the receive configuration register. Cleared on read.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_LPI</name>
          <description>Transmit LPI transitions</description>
          <addressOffset>0x1278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COUNT_LPI</name>
              <description>Count of LPI transmissions. A count of the number of times the enable LPI transmission bit 20 goes from low to high in the transmit control register.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_LPI_TIME</name>
          <description>Transmit LPI time</description>
          <addressOffset>0x127C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI_TIME</name>
              <description>Time in LPI. This register increments once every 16 pclk cycles when the enable LPI transmission bit 20 is set in the transmit control register. Cleared on read.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG1</name>
          <description>The GEM_GXL(3PIP) has many parameterisation options to configure the IP during compilation stage. This is achieved using Verilog define compiler directives in an include file called mxeth_defs.v.</description>
          <addressOffset>0x1280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2508503</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NO_PCS</name>
              <description>Takes the value of the `gem_no_pcs DEFINE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXCLUDE_QBV</name>
              <description>Takes the value of the `gem_exclude_qbv DEFINE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_2</name>
              <description>N/A</description>
              <bitRange>[3:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INT_LOOPBACK</name>
              <description>Takes the value of the `gem_int_loopback DEFINE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_5</name>
              <description>N/A</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_FIFO_INTERFACE</name>
              <description>Takes the value of the `gem_ext_fifo_interface DEFINE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_8</name>
              <description>N/A</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USER_IO</name>
              <description>Takes the value of the `gem_user_io DEFINE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USER_OUT_WIDTH</name>
              <description>Takes the value of the `gem_user_out_width DEFINE if `gem_user_io is set.
If 'gem_user_io is not set, the value is 0x01</description>
              <bitRange>[14:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USER_IN_WIDTH</name>
              <description>Takes the value of the `gem_user_in_width DEFINE `gem_user_io.
If 'gem_user_io is not set, the value is 0x01</description>
              <bitRange>[19:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_20</name>
              <description>N/A</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NO_STATS</name>
              <description>Takes the value of the `gem_no_stats DEFINE</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NO_SNAPSHOT</name>
              <description>Takes the value of the `gem_no_snapshot DEFINE</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IRQ_READ_CLEAR</name>
              <description>Takes the value of the `gem_irq_read_clear DEFINE</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXCLUDE_CBS</name>
              <description>Takes the value of the `gem_exclude_cbs DEFINE</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_BUS_WIDTH</name>
              <description>Takes the value of bits 7:5 of the `gem_dma_bus_width DEFINE. So if the define is set to decimal 64 this will return binary 010.</description>
              <bitRange>[27:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_CACHE_VALUE</name>
              <description>Takes the value of the `gem_axi_awcache_value DEFINE</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG2</name>
          <description>Design Configuration Register 2</description>
          <addressOffset>0x1284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE6310600</resetValue>
          <resetMask>0xFFFF3FFF</resetMask>
          <fields>
            <field>
              <name>JUMBO_MAX_LENGTH</name>
              <description>Takes the value of the `gem_jumbo_max_length DEFINE</description>
              <bitRange>[13:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HPROT_VALUE</name>
              <description>Takes the value of the `gem_hprot_value DEFINE</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PKT_BUFFER</name>
              <description>Takes the value of the `gem_rx_pkt_buffer DEFINE</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PKT_BUFFER</name>
              <description>Takes the value of the `gem_tx_pkt_buffer DEFINE</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PBUF_ADDR</name>
              <description>Takes the value of the `gem_rx_pbuf_addr DEFINE</description>
              <bitRange>[25:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_ADDR</name>
              <description>Takes the value of the `gem_tx_pbuf_addr DEFINE</description>
              <bitRange>[29:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI</name>
              <description>Takes the value of the `gem_axi DEFINE</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPRAM</name>
              <description>Takes the value of the `gem_spram DEFINE</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG3</name>
          <description>Design Configuration Register 3</description>
          <addressOffset>0x1288</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4000000</resetValue>
          <resetMask>0x3F000000</resetMask>
          <fields>
            <field>
              <name>NUM_SPEC_ADD_FILTERS</name>
              <description>Takes the value of the `num_spec_add_filters DEFINE</description>
              <bitRange>[29:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG4</name>
          <description>Design Configuration Register 4</description>
          <addressOffset>0x128C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD_31_0</name>
              <description>N/A</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
