RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>DESIGNCFG_DEBUG5</name>
          <description>Design Configuration Register 5</description>
          <addressOffset>0x1290</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x518E3744</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FIFO_CNT_WIDTH</name>
              <description>Takes the value of the `gem_rx_fifo_cnt_width DEFINE</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_FIFO_CNT_WIDTH</name>
              <description>Takes the value of the `gem_tx_fifo_cnt_width DEFINE</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSU</name>
              <description>Takes the value of the `gem_tsu DEFINE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_IDENT</name>
              <description>Takes the value of the `gem_phy_ident DEFINE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_BUS_WIDTH_DEF</name>
              <description>Takes the value of the `gem_dma_bus_width_def DEFINE</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MDC_CLOCK_DIV</name>
              <description>Takes the value of the `gem_mdc_clock_div DEFINE</description>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ENDIAN_SWAP_DEF</name>
              <description>Takes the value of the `gem_endian_swap_def DEFINE</description>
              <bitRange>[16:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PBUF_SIZE_DEF</name>
              <description>Takes the value of the `gem_rx_pbuf_size_def DEFINE</description>
              <bitRange>[18:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_SIZE_DEF</name>
              <description>Takes the value of the `gem_tx_pbuf_size_def DEFINE</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_BUFFER_LENGTH_DEF</name>
              <description>Takes the value of the `gem_rx_buffer_length_def DEFINE</description>
              <bitRange>[27:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSU_CLK</name>
              <description>Takes the value of the `gem_tsu_clk DEFINE</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_PROT_VALUE</name>
              <description>Takes the value of the `gem_axi_prot_value DEFINE</description>
              <bitRange>[31:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG6</name>
          <description>Design Configuration Register 6</description>
          <addressOffset>0x1294</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3020006</resetValue>
          <resetMask>0xFFFFFFE</resetMask>
          <fields>
            <field>
              <name>DMA_PRIORITY_QUEUE1</name>
              <description>Takes the value of the `dma_priority_queue1 DEFINE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE2</name>
              <description>Takes the value of the `dma_priority_queue2 DEFINE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE3</name>
              <description>Takes the value of the `dma_priority_queue3 DEFINE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE4</name>
              <description>Takes the value of the `dma_priority_queue4 DEFINE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE5</name>
              <description>Takes the value of the `dma_priority_queue5 DEFINE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE6</name>
              <description>Takes the value of the `dma_priority_queue6 DEFINE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE7</name>
              <description>Takes the value of the `dma_priority_queue7 DEFINE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE8</name>
              <description>Takes the value of the `dma_priority_queue8 DEFINE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE9</name>
              <description>Takes the value of the `dma_priority_queue9 DEFINE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE10</name>
              <description>Takes the value of the `dma_priority_queue10 DEFINE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE11</name>
              <description>Takes the value of the `dma_priority_queue11 DEFINE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE12</name>
              <description>Takes the value of the `dma_priority_queue12 DEFINE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE13</name>
              <description>Takes the value of the `dma_priority_queue13 DEFINE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE14</name>
              <description>Takes the value of the `dma_priority_queue14 DEFINE</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_PRIORITY_QUEUE15</name>
              <description>Takes the value of the `dma_priority_queue15 DEFINE</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_QUEUE_SEGMENT_SIZE</name>
              <description>Takes the value of the `gem_tx_pbuf_queue_segment_size DEFINE</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_TSU_TIMER</name>
              <description>Takes the value of the `gem_ext_tsu_timer DEFINE</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_ADD_FIFO_IF</name>
              <description>Takes the value of the `gem_tx_add_fifo_if DEFINE</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HOST_IF_SOFT_SELECT</name>
              <description>Takes the value of the `gem_host_if_soft_select DEFINE</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_ADDR_WIDTH_IS_64B</name>
              <description>Takes the value of the `gem_dma_addr_width_is_64b DEFINE</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PFC_MULTI_QUANTUM</name>
              <description>Takes the value of the `gem_pfc_multi_quantum DEFINE</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PBUF_CUTTHRU</name>
              <description>Takes the value of the `gem_pbuf_cutthru DEFINE</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PBUF_RSC</name>
              <description>Takes the value of the `gem_pbuf_rsc DEFINE</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PBUF_LSO</name>
              <description>Takes the value of the `gem_pbuf_lso DEFINE</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG7</name>
          <description>Design Configuration Register 7</description>
          <addressOffset>0x1298</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q0</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q0 DEFINE</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q1</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q1 DEFINE</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q2</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q2 DEFINE</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q3</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q3 DEFINE</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q4</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q4 DEFINE</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q5</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q5 DEFINE</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q6</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q6 DEFINE</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>X_PBUF_NUM_SEGMENTS_Q7</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q7 DEFINE</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG8</name>
          <description>Design Configuration Register 8</description>
          <addressOffset>0x129C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10100820</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM_SCR2_COMPARE_REGS</name>
              <description>Takes the value of the `num_scr2_compare_regs DEFINE</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_SCR2_ETHTYPE_REGS</name>
              <description>Takes the value of the `num_scr2_ethtype_regs DEFINE</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_TYPE2_SCREENERS</name>
              <description>Takes the value of the `num_type2_screeners DEFINE</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_TYPE1_SCREENERS</name>
              <description>Takes the value of the `num_type1_screeners DEFINE</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG9</name>
          <description>Design Configuration Register 9</description>
          <addressOffset>0x12A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q8</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q8 DEFINE</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q9</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q9 DEFINE</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q10</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q10 DEFINE</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q11</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q11 DEFINE</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q12</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q12 DEFINE</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q13</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q13 DEFINE</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q14</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q14 DEFINE</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_NUM_SEGMENTS_Q15</name>
              <description>Takes the value of the `gem_tx_pbuf_num_segments_q15 DEFINE</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESIGNCFG_DEBUG10</name>
          <description>Design Configuration Register 10</description>
          <addressOffset>0x12A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x14411111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXI_RX_DESCR_WR_BUFF_BITS</name>
              <description>Takes the value of the `gem_axi_rx_descr_wr_buff_bits DEFINE</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_TX_DESCR_WR_BUFF_BITS</name>
              <description>Takes the value of the `gem_axi_tx_descr_wr_buff_bits DEFINE</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_RX_DESCR_RD_BUFF_BITS</name>
              <description>Takes the value of the `gem_axi_rx_descr_rd_buff_bits DEFINE</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_TX_DESCR_RD_BUFF_BITS</name>
              <description>Takes the value of the `gem_axi_tx_descr_rd_buff_bits DEFINE</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_ACCESS_PIPELINE_BITS</name>
              <description>Takes the value of the `gem_axi_access_pipeline_bits DEFINE</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PBUF_DATA</name>
              <description>Takes the value of the `gem_rx_pbuf_data DEFINE. 1 - The RX DPRAM has a datawidth of 32bits. 2 - The RX DPRAM has a datawidth of 64bits. 4 - RX The DPRAM has a datawidth of 128bits</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PBUF_DATA</name>
              <description>Takes the value of the `gem_tx_pbuf_data DEFINE. 1 - The TX DPRAM has a datawidth of 32bits. 2 - The TX DPRAM has a datawidth of 64bits. 4 - The TX DPRAM has a datawidth of 128bits</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_BUS_WIDTH</name>
              <description>Takes the value of the `gem_emac_bus_width DEFINE. 1 - The MAC has a datawidth of 32bits. 2 - The MAC has a datawidth of 64bits. 4 - The MAC has a datawidth of 128bits</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEC_ADD5_BOTTOM</name>
          <description>Specific address registers 5 ~ 36 doesn't present. Access to the register returns AHB error.</description>
          <addressOffset>0x1300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEC_ADD5_TOP</name>
          <description>Specific address registers 5 ~ 36 doesn't present. Access to the register returns AHB error.</description>
          <addressOffset>0x1304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEC_ADD36_BOTTOM</name>
          <description>Not presents.</description>
          <addressOffset>0x13F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEC_ADD36_TOP</name>
          <description>Not presents.</description>
          <addressOffset>0x13FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
