RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>INT_Q1_STATUS</name>
          <description>Priority queue Interrupt Status Register</description>
          <addressOffset>0x1400</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>RECEIVE_COMPLETE</name>
              <description>Receive complete</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_USED_BIT_READ</name>
              <description>RX used bit read</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION</name>
              <description>Retry limit exceeded or late collision</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AMBA_ERROR</name>
              <description>Transmit frame corruption due to AMBA (AXI) error set if an error occurs whilst midway through reading transmit frame from the external memory, including RRESP and BRESP errors (AXI) and buffers exhausted mid frame</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANSMIT_COMPLETE</name>
              <description>Transmit complete</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_NOT_OK</name>
              <description>bresp not OK</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q2_STATUS</name>
          <description>Priority queue Interrupt Status Register</description>
          <addressOffset>0x1404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>RECEIVE_COMPLETE</name>
              <description>Receive complete</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_USED_BIT_READ</name>
              <description>RX used bit read</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION</name>
              <description>Retry limit exceeded or late collision</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AMBA_ERROR</name>
              <description>Transmit frame corruption due to AMBA (AXI) error set if an error occurs whilst midway through reading transmit frame from the external memory, including RRESP and BRESP errors (AXI) and buffers exhausted mid frame</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANSMIT_COMPLETE</name>
              <description>Transmit complete</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_NOT_OK</name>
              <description>bresp not OK</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q3_STATUS</name>
          <description>int_q3_status to int_q15_status doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x1408</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q15_STATUS</name>
          <description>Not presents.</description>
          <addressOffset>0x1438</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRANSMIT_Q1_PTR</name>
          <description>This register holds the start address of the transmit buffer queue (transmit buffers descriptor list). The transmit buffer queue base address register must be initialized before transmit is started through bit 9 of the network control register. Once transmission has started, any write to the transmit buffer queue base address register is illegal and therefore ignored. Note that due to clock boundary synchronization, it takes a maximum of four pclk cycles from the writing of the transmit start bit before the transmitter is active. Writing to the transmit buffer queue base address register during this time may produce unpredictable results. Reading this register returns the location of the descriptor currently being accessed. Because the DMA can store data for multiple frames at once, this may not necessarily be pointing to the current frame being transmitted. In terms of AMBA AXI operation, the transmit descriptors are written to memory using a single 32bit AHB access. When the datapath is configured as 64bit , the transmit descriptors should be aligned at 64-bit boundaries and each pair of 32-bit descriptors is read from memory using a single AXI access.</description>
          <addressOffset>0x1440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFD</resetMask>
          <fields>
            <field>
              <name>DMA_TX_DIS_Q</name>
              <description>Disable queue if set to 1. This can be used to reduce the number of active queues and should only be changed while transmit is not enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_Q_PTR</name>
              <description>This register holds the start address of the transmit buffer queue (transmit buffers
descriptor list). The transmit buffer queue base address register must be initialized before
transmit is started through bit 9 of the network control register. Once transmission has
started, any write to the transmit buffer queue base address register is illegal and
therefore ignored. Note that due to clock boundary synchronization, it takes a maximum
of four pclk cycles from the writing of the transmit start bit before the transmitter is active.
Writing to the transmit buffer queue base address register during this time may produce
unpredictable results. Reading this register returns the location of the descriptor currently
being accessed. Because the DMA can store data for multiple frames at once, this may
not necessarily be pointing to the current frame being transmitted. In terms of AMBA
AHB/AXI operation, the transmit descriptors are written to memory using a single 32bit
AHB access. When the datapath is configured as 64bit or 128bit, the transmit descriptors
should be aligned at 64-bit boundaries and each pair of 32-bit descriptors is read from
memory using a single AHB/AXI access. For 32bit datapaths, the descriptors should be
aligned at 32-bit boundaries and the descriptors are read from memory using two
individual 32-bit non sequential accesses.</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRANSMIT_Q2_PTR</name>
          <description>This register holds the start address of the transmit buffer queue (transmit buffers descriptor list). The transmit buffer queue base address register must be initialized before transmit is started through bit 9 of the network control register. Once transmission has started, any write to the transmit buffer queue base address register is illegal and therefore ignored. Note that due to clock boundary synchronization, it takes a maximum of four pclk cycles from the writing of the transmit start bit before the transmitter is active. Writing to the transmit buffer queue base address register during this time may produce unpredictable results. Reading this register returns the location of the descriptor currently being accessed. Because the DMA can store data for multiple frames at once, this may not necessarily be pointing to the current frame being transmitted. In terms of AMBA AXI operation, the transmit descriptors are written to memory using a single 32bit AHB access. When the datapath is configured as 64bit , the transmit descriptors should be aligned at 64-bit boundaries and each pair of 32-bit descriptors is read from memory using a single AXI access.</description>
          <addressOffset>0x1444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFD</resetMask>
          <fields>
            <field>
              <name>DMA_TX_DIS_Q</name>
              <description>Disable queue if set to 1. This can be used to reduce the number of active queues and should only be changed while transmit is not enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_Q_PTR</name>
              <description>This register holds the start address of the transmit buffer queue (transmit buffers
descriptor list). The transmit buffer queue base address register must be initialized before
transmit is started through bit 9 of the network control register. Once transmission has
started, any write to the transmit buffer queue base address register is illegal and
therefore ignored. Note that due to clock boundary synchronization, it takes a maximum
of four pclk cycles from the writing of the transmit start bit before the transmitter is active.
Writing to the transmit buffer queue base address register during this time may produce
unpredictable results. Reading this register returns the location of the descriptor currently
being accessed. Because the DMA can store data for multiple frames at once, this may
not necessarily be pointing to the current frame being transmitted. In terms of AMBA
AHB/AXI operation, the transmit descriptors are written to memory using a single 32bit
AHB access. When the datapath is configured as 64bit or 128bit, the transmit descriptors
should be aligned at 64-bit boundaries and each pair of 32-bit descriptors is read from
memory using a single AHB/AXI access. For 32bit datapaths, the descriptors should be
aligned at 32-bit boundaries and the descriptors are read from memory using two
individual 32-bit non sequential accesses</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRANSMIT_Q3_PTR</name>
          <description>transmit_q3_ptr to transmit_q15_ptr doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x1448</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Disable queue if set to 1. This can be used to reduce the number of active queues and should only be changed while transmit is not enabled.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRANSMIT_Q15_PTR</name>
          <description>Not presents.</description>
          <addressOffset>0x1478</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECEIVE_Q1_PTR</name>
          <description>This register holds the start address of the transmit buffer queue (transmit buffers descriptor list). The transmit buffer queue base address register must be initialized before transmit is started through bit 9 of the network control register. Once transmission has started, any write to the transmit buffer queue base address register is illegal and therefore ignored. Note that due to clock boundary synchronization, it takes a maximum of four pclk cycles from the writing of the transmit start bit before the transmitter is active. Writing to the transmit buffer queue base address register during this time may produce unpredictable results. Reading this register returns the location of the descriptor currently being accessed. Because the DMA can store data for multiple frames at once, this may not necessarily be pointing to the current frame being transmitted. In terms of AMBA AXI operation, the transmit descriptors are written to memory using a single 32bit AHB access. When the datapath is configured as 64bit , the transmit descriptors should be aligned at 64-bit boundaries and each pair of 32-bit descriptors is read from memory using a single AXI access.</description>
          <addressOffset>0x1480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFD</resetMask>
          <fields>
            <field>
              <name>DMA_RX_DIS_Q</name>
              <description>Disable queue if set to 1. This can be used to reduce the number of active queues and should only be changed while receive is not enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_Q_PTR</name>
              <description>Receive buffer queue base address - written with the address of the start of the receive queue.</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECEIVE_Q2_PTR</name>
          <description>This register holds the start address of the transmit buffer queue (transmit buffers descriptor list). The transmit buffer queue base address register must be initialized before transmit is started through bit 9 of the network control register. Once transmission has started, any write to the transmit buffer queue base address register is illegal and therefore ignored. Note that due to clock boundary synchronization, it takes a maximum of four pclk cycles from the writing of the transmit start bit before the transmitter is active. Writing to the transmit buffer queue base address register during this time may produce unpredictable results. Reading this register returns the location of the descriptor currently being accessed. Because the DMA can store data for multiple frames at once, this may not necessarily be pointing to the current frame being transmitted. In terms of AMBA AXI operation, the transmit descriptors are written to memory using a single 32bit AHB access. When the datapath is configured as 64bit , the transmit descriptors should be aligned at 64-bit boundaries and each pair of 32-bit descriptors is read from memory using a single AXI access.</description>
          <addressOffset>0x1484</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFD</resetMask>
          <fields>
            <field>
              <name>DMA_RX_DIS_Q</name>
              <description>Disable queue if set to 1. This can be used to reduce the number of active queues and should only be changed while receive is not enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_Q_PTR</name>
              <description>Receive buffer queue base address - written with the address of the start of the receive queue.</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECEIVE_Q3_PTR</name>
          <description>Not presents.  Start address register doesn't present for queue3 ~ queue7.</description>
          <addressOffset>0x1488</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECEIVE_Q7_PTR</name>
          <description>Not presents.</description>
          <addressOffset>0x1498</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RXBUF_SIZE_Q1</name>
          <description>Receive Buffer queue 1 Size</description>
          <addressOffset>0x14A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DMA_RX_Q_BUF_SIZE</name>
              <description>DMA receive buffer size in system memory. The value defined by these bits determines the size of buffer to use in main system memory when writing received data. The value is defined in multiples of 64 bytes.
 0x01 corresponds to buffers of 64 bytes.
 0x02 corresponds to 128 bytes etc. 
For example:
 0x02: 128 byte
 0x18: 1536 byte (1*max length frame/buffer)
 0xA0: 10240 byte (1*10K jumbo frame/buffer) 
Note that this value should never be written as zero. Note. The reset value of this field is equal to the gem_rx_buffer_length_def define, which is user configurable.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RXBUF_SIZE_Q2</name>
          <description>Receive Buffer queue 2 Size</description>
          <addressOffset>0x14A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DMA_RX_Q_BUF_SIZE</name>
              <description>DMA receive buffer size in system memory. The value defined by these bits determines the size of buffer to use in main system memory when writing received data. The value is defined in multiples of 64 bytes.
 0x01 corresponds to buffers of 64 bytes.
 0x02 corresponds to 128 bytes etc. 
For example:
 0x02: 128 byte
 0x18: 1536 byte (1*max length frame/buffer)
 0xA0: 10240 byte (1*10K jumbo frame/buffer) 
Note that this value should never be written as zero. Note. The reset value of this field is equal to the gem_rx_buffer_length_def define, which is user configurable.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RXBUF_SIZE_Q3</name>
          <description>dma_rxbuf_size_q3 to dma_rxbuf_size_q7 doesn't present.</description>
          <addressOffset>0x14A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>DMA receive buffer size in system memory. The value defined by these bits determines the size of buffer to use in main system memory when writing received data. The value is defined in multiples of 64 bytes.
 0x01 corresponds to buffers of 64 bytes.
 0x02 corresponds to 128 bytes etc. 
For example:
 0x02: 128 byte
 0x18: 1536 byte (1*max length frame/buffer)
 0xA0: 10240 byte (1*10K jumbo frame/buffer) 
Note that this value should never be written as zero. Note. The reset value of this field is equal to the gem_rx_buffer_length_def define, which is user configurable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RXBUF_SIZE_Q7</name>
          <description>Not presents.</description>
          <addressOffset>0x14B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
