RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>SCREENING_TYPE_2_REGISTER_8</name>
          <description>screening type 2 register 8, same as screening_type_2_register_0</description>
          <addressOffset>0x1560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_REGISTER_9</name>
          <description>screening type 2 register 9, same as screening_type_2_register_0</description>
          <addressOffset>0x1564</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_REGISTER_10</name>
          <description>screening type 2 register 10, same as screening_type_2_register_0</description>
          <addressOffset>0x1568</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_REGISTER_11</name>
          <description>screening type 2 register 11, same as screening_type_2_register_0</description>
          <addressOffset>0x156C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_REGISTER_12</name>
          <description>screening type 2 register 12, same as screening_type_2_register_0</description>
          <addressOffset>0x1570</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_REGISTER_13</name>
          <description>screening type 2 register 13, same as screening_type_2_register_0</description>
          <addressOffset>0x1574</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
