RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>INT_Q2_ENABLE</name>
          <description>At reset all interrupts are disabled. Writing a one to the relevant bit location enables the required interrupt. This register is write only and when read will return zero.</description>
          <addressOffset>0x1604</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>ENABLE_RECEIVE_COMPLETE_INTERRUPT</name>
              <description>Enable Receive complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RX_USED_BIT_READ_INTERRUPT</name>
              <description>Enable RX used bit read interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT</name>
              <description>Enable Retry limit exceeded or late collision interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT</name>
              <description>Enable Transmit frame corruption due to AMBA (AXI) error interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_COMPLETE_INTERRUPT</name>
              <description>Enable Transmit complete interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RESP_NOT_OK_INTERRUPT</name>
              <description>Enable bresp not OK interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q3_ENABLE</name>
          <description>int_q3_enable to int_q7_enable doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x1608</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q7_ENABLE</name>
          <description>Not presents.</description>
          <addressOffset>0x1618</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q1_DISABLE</name>
          <description>Writing a 1 to the relevant bit location disables that particular interrupt. This register is write only and when read will return zero.</description>
          <addressOffset>0x1620</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>DISABLE_RECEIVE_COMPLETE_INTERRUPT</name>
              <description>Disable Receive complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RX_USED_BIT_READ_INTERRUPT</name>
              <description>Disable RX used bit read interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT</name>
              <description>Disable Retry limit exceeded or late collision interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT</name>
              <description>Disable Transmit frame corruption due to AMBA (AXI) error interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_COMPLETE_INTERRUPT</name>
              <description>Disable Transmit complete interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RESP_NOT_OK_INTERRUPT</name>
              <description>Disable bresp not OK interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q2_DISABLE</name>
          <description>Writing a 1 to the relevant bit location disables that particular interrupt. This register is write only and when read will return zero.</description>
          <addressOffset>0x1624</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>DISABLE_RECEIVE_COMPLETE_INTERRUPT</name>
              <description>Disable Receive complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RX_USED_BIT_READ_INTERRUPT</name>
              <description>Disable RX used bit read interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT</name>
              <description>Disable Retry limit exceeded or late collision interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT</name>
              <description>Disable Transmit frame corruption due to AMBA (AXI) error interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_COMPLETE_INTERRUPT</name>
              <description>Disable Transmit complete interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RESP_NOT_OK_INTERRUPT</name>
              <description>Disable bresp not OK interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q3_DISABLE</name>
          <description>int_q3_disable to int_q7_disable doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x1628</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q7_DISABLE</name>
          <description>Not presents.</description>
          <addressOffset>0x1638</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q1_MASK</name>
          <description>The interrupt mask register is a read only register indicating which interrupts are masked. All bits are set at reset and can be reset individually by writing to the interrupt enable register or set individually by writing to the interrupt disable register. Having separate address locations for enable and disable saves the need for performing a read modify write when updating the interrupt mask register. For test purposes there is a write-only function to this register that allows the bits in the interrupt status register to be set or cleared, regardless of the state of the mask register.</description>
          <addressOffset>0x1640</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8E6</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>RECEIVE_COMPLETE_INTERRUPT_MASK</name>
              <description>receive complete interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_USED_INTERRUPT_MASK</name>
              <description>A read of this register returns the value of the RX Used interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_MASK</name>
              <description>retry limit exceeded or late collision interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AMBA_ERROR_INTERRUPT_MASK</name>
              <description>A read of this register returns the value of the AMBA (AXI) error interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANSMIT_COMPLETE_INTERRUPT_MASK</name>
              <description>transmit complete interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_NOT_OK_INTERRUPT_MASK</name>
              <description>bresp not OK interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q2_MASK</name>
          <description>The interrupt mask register is a read only register indicating which interrupts are masked. All bits are set at reset and can be reset individually by writing to the interrupt enable register or set individually by writing to the interrupt disable register. Having separate address locations for enable and disable saves the need for performing a read modify write when updating the interrupt mask register. For test purposes there is a write-only function to this register that allows the bits in the interrupt status register to be set or cleared, regardless of the state of the mask register.</description>
          <addressOffset>0x1644</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8E6</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>RECEIVE_COMPLETE_INTERRUPT_MASK</name>
              <description>receive complete interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_USED_INTERRUPT_MASK</name>
              <description>A read of this register returns the value of the RX Used interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_MASK</name>
              <description>retry limit exceeded or late collision interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AMBA_ERROR_INTERRUPT_MASK</name>
              <description>A read of this register returns the value of the AMBA (AXI) error interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANSMIT_COMPLETE_INTERRUPT_MASK</name>
              <description>transmit complete interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RESP_NOT_OK_INTERRUPT_MASK</name>
              <description>bresp not OK interrupt mask.
 0: Interrupt is enabled.
 1: Interrupt is disabled. 
A write to this register directly affects the state of the corresponding bit in the interrupt status register, causing an interrupt to be generated if a 1 is written.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q3_MASK</name>
          <description>int_q3_mask to int_q7_mask doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x1648</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q7_MASK</name>
          <description>Not presents.</description>
          <addressOffset>0x1658</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q8_ENABLE</name>
          <description>int_q8_enable to int_q15_enable doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x1660</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q15_ENABLE</name>
          <description>Not presents.</description>
          <addressOffset>0x167C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q8_DISABLE</name>
          <description>int_q8_disable to int_q15_disable doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x1680</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q15_DISABLE</name>
          <description>Not presents.</description>
          <addressOffset>0x169C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q8_MASK</name>
          <description>int_q8_mask to int_q15_mask doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x16A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q15_MASK</name>
          <description>Not presents.</description>
          <addressOffset>0x16BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_ETHERTYPE_REG_0</name>
          <description>Ethertype Register</description>
          <addressOffset>0x16E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARE_VALUE</name>
              <description>'EtherType compare value'</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31_16</name>
              <description>N/A</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_ETHERTYPE_REG_1</name>
          <description>Ethertype Register</description>
          <addressOffset>0x16E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARE_VALUE</name>
              <description>'EtherType compare value'</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31_16</name>
              <description>N/A</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
