RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>TEST1</name>
          <description>Test Register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0xFF3F0333</resetMask>
          <fields>
            <field>
              <name>WRTEN</name>
              <description>Write Test Register Enable
Enables write access to the test registers. To set the bit from '0' to '1' the test mode key has to be written as defined in [01]Section 4.3.3 Lock Register (LCK). The unlock sequence is not required when WRTEN is kept at '1' while other bits of the register are changed. The bit can be reset to '0' at any time.
1 = Write access to test registers enabled
0 = Write access to test registers disabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST_REG_WR_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_REG_WR_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELBE</name>
              <description>External Loop Back Enable
There are two possibilities to perform a Loop Back test. External Loop Back via physical layer or internal Loop Back for in-system self-test (default). In case of an internal Loop Back pins eray_txen1,2_n are in their inactive state, pins eray_txd1,2 are set to HIGH, pins eray_rxd1,2 are not evaluated. Bit ELBE is evaluated only when POC is in Loop Back Mode and test multiplexer control is in non-multiplexing mode TMC[1:0] = '00'.
1 = External Loop Back
0 = Internal Loop Back (default)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNAL_LOOP_BACK</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_LOOP_BACK</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMC</name>
              <description>Test Multiplexer Control
00, 11= Normal signal path (default)
01      = RAM Test Mode - Internal busses are multiplexed to make all RAM blocks of the ERay
             module directly accessible by the Host. This mode is intended to enable testing of
             the embedded RAM blocks during production testing.
10      = I/O Test Mode - Output pins eray_txd1, eray_txd2, eray_txen1_n, eray_txen2_n, are
             driven to the values defined by bits TXA, TXB, TXENA, TXENB. The values applied
             to the input pins eray_rxd1, eray_rxd2 can be read from register bits RXA, RXB.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_SIGNAL_PATH</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_SIGNAL_PATH_MIRROR</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_TEST_MODE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO_TEST_MODE</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AOA</name>
              <description>Activity on A
AOA is set when there is activity on channel A. It is reset when 11 consecutive '1' bits are
detected or if the POC state is DEFAULT_CONFIG or CONFIG. During STARTUP,
NORMAL_ACTIVE, or NORMAL_PASSIVE the function of AOA is the inverse of zChannelIdle
as specified in the FlexRay protocol spec v2.1, chapter 3, BITSTRB process. AOA should
be ignored in all other POC states.
1 = Activity detected, channel A not idle
0 = No activity detected, channel A idle</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACT_DETECT_CH_A_IDLE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT_DETECT_CH_A_NOT_IDLE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AOB</name>
              <description>Activity on B
AOB is set when there is activity on channel B. It is reset when 11 consecutive '1' bits are
detected or if the POC state is DEFAULT_CONFIG or CONFIG. During STARTUP,
NORMAL_ACTIVE, or NORMAL_PASSIVE the function of AOB is the inverse of zChannel-
Idle as specified in the FlexRay protocol spec v2.1, chapter 3, BITSTRB process. AOB should
be ignored in all other POC states.
1 = Activity detected, channel B not idle
0 = No activity detected, channel B idle</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACT_DETECT_CH_B_IDLE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT_DETECT_CH_B_NOT_IDLE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXA</name>
              <description>Monitor Channel A Receive Pin
This is used to test the interface to the physical layer (connectivity test) by reading the pin.
0 = eray_rxd1 = '0'
1 = eray_rxd1 = '1'</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_RXD1_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_RXD1_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXB</name>
              <description>Monitor Channel B Receive Pin
This is used to test the interface to the physical layer (connectivity test) by reading the pin.
0 = eray_rxd2 = '0'
1 = eray_rxd2 = '1'</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_RXD2_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_RXD2_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXA</name>
              <description>Control of Channel A Transmit Pin
This is used to test the interface to the physical layer (connectivity test) by driving the pin.
0 = eray_txd1 pin drives a '0'
1 = eray_txd1 pin drives a '1'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_TXD1_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_TXD1_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXB</name>
              <description>Control of Channel B Transmit Pin
This is used to test the interface to the physical layer (connectivity test) by driving the pin.
0 = eray_txd2 pin drives a '0'
1 = eray_txd2 pin drives a '1'</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_TXD2_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_TXD2_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENA</name>
              <description>Control of Channel A Transmit Enable Pin
This is used to test the interface to the physical layer (connectivity test) by driving the pin.
0 = eray_txen1_n pin drives a '0'
1 = eray_txen1_n pin drives a '1'</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_TXEN1_N_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_TXEN1_N_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENB</name>
              <description>Control of Channel B Transmit Enable Pin
This is used to test the interface to the physical layer (connectivity test) by driving the pin.
0 = eray_txen2_n pin drives a '0'
1 = eray_txen2_n pin drives a '1'</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_TXEN2_N_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_TXEN2_N_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CERA</name>
              <description>N/A</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CODING_ERR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_CRC_ERR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_CRC_ERR</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_START_SEQ_FSS_LONG</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST_BIT_OF_BSS_LOW</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND_BIT_OF_BSS_HIGH</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST_BIT_OF_FES_HIGH</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND_BIT_OF_FES_LOW</name>
                  <description>N/A</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAS_MTS_SYMBOL_SHORT</name>
                  <description>N/A</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAS_MTS_SYMBOL_LONG</name>
                  <description>N/A</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CERB</name>
              <description>N/A</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CODING_ERR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_CRC_ERR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_CRC_ERR</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_START_SEQ_FSS_LONG</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST_BIT_OF_BSS_LOW</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND_BIT_OF_BSS_HIGH</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST_BIT_OF_FES_HIGH</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND_BIT_OF_FES_LOW</name>
                  <description>N/A</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAS_MTS_SYMBOL_SHORT</name>
                  <description>N/A</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAS_MTS_SYMBOL_LONG</name>
                  <description>N/A</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST2</name>
          <description>Test Register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC077</resetMask>
          <fields>
            <field>
              <name>RS</name>
              <description>RAM Select
In RAM Test mode the RAM blocks selected by RS[2:0] are mapped to module address 0x400
to 7FF (1024 byte addresses).
000 = Input Buffer RAM 1 (IBF1)
001 = Input Buffer RAM 2 (IBF2)
010 = Output Buffer RAM 1 (OBF1)
011 = Output Buffer RAM 2 (OBF2)
100 = Transient Buffer RAM A (TBF1)
101 = Transient Buffer RAM B (TBF2)
110 = Message RAM (MBF)
111 = unused</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBF1</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBF2</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBF1</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBF2</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBF1</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBF2</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBF</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSEL</name>
              <description>Segment Select
To enable access to the complete Message RAM (8192 byte addresses) the Message RAM is
segmented.
000 = access to RAM bytes 0000h to 03FFh enabled
001 = access to RAM bytes 0400h to 07FFh enabled
010 = access to RAM bytes 0800h to 0BFFh enabled
011 = access to RAM bytes 0C00h to 0FFFh enabled
100 = access to RAM bytes 1000h to 13FFh enabled
101 = access to RAM bytes 1400h to 17FFh enabled
110 = access to RAM bytes 1800h to 1BFFh enabled
111 = access to RAM bytes 1C00h to 1FFFh enabled</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_0000_TO_03FF_ENABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_0400_TO_07FF_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_0800_TO_0BFF_ENABLED</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_0C00_TO_0FFF_ENABLED</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_1000_TO_13FF_ENABLED</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_1400_TO_17FF_ENABLED</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_1800_TO_1BFF_ENABLED</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_1C00_TO_1FFF_ENABLED</name>
                  <description>N/A</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRPB</name>
              <description>Write Parity Bit
Value of parity bit to be written to bit 32 of the addressed RAM word.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDPB</name>
              <description>Read Parity Bit
Value of parity bit read from bit 32 of the addressed RAM word.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCK</name>
          <description>Lock Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CLK</name>
              <description>Configuration Lock Key
To leave CONFIG state by writing SUCC1.CMD[3:0] (commands READY,
MONITOR_MODE, ATM, LOOP_BACK), the write operation has to be directly preceded by
two write accesses to the Configuration Lock Key (unlock sequence). If the write sequence
below is interrupted by other write accesses between the second write to the Configuration Lock
Key and the write access to the SUCC1 register, the CC remains in CONFIG state and the
sequence has to be repeated.
First write: LCK.CLK[7:0] = '1100 1110' (0xCE)
Second write: LCK.CLK[7:0] = '0011 0001' (0x31)
Third write: SUCC1.CMD[3:0]</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TMK</name>
              <description>Test Mode Key
To write bit TEST1.WRTEN, the write operation has to be directly preceded by two consecutive
write accesses to the Test Mode Key (unlock sequence). If the write sequence below is
interrupted by other write accesses between the second write to the Test Mode Key and the write
access to the TEST1 register, TEST1.WRTEN is not set to '1' and the sequence has to be
repeated.
First write: LCK.TMK[7:0] = '0111 0101' (0x75)
Second write: LCK.TMK[7:0] = '1000 1010' (0x8A)
Third write: TEST1.WRTEN = '1'</description>
              <bitRange>[15:8]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
