RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>EIR</name>
          <description>Error Interrupt Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7070FFF</resetMask>
          <fields>
            <field>
              <name>PEMC</name>
              <description>POC Error Mode Changed
This flag is set whenever the error mode signalled by CCEV.ERRM[1:0] has changed.
1 = Error mode has changed
0 = Error mode has not changed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POC_ERR_MODE_UNCHANGED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POC_ERR_MODE_CHANGED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNA</name>
              <description>Command Not Accepted
The flag signals that the write access to the CHI command vector SUCC1.CMD[3:0] was not
successful because the requested command was not valid in the actual POC state, or because the
CHI command was locked (CCL = '1').
1 = CHI command not accepted
0 = CHI command accepted</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHI_CMD_ACCEPTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHI_CMD_NOT_ACCEPTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFBM</name>
              <description>Sync Frames Below Minimum
This flag signals that the number of sync frames received during the last communication cycle
was below the limit required by the FlexRay protocol. May be set during startup and therefore
should be cleared by the Host after the CC entered NORMAL_ACTIVE state.
1 = Less than the required minimum of sync frames received
0 = Sync node: 1 or more sync frames received, non-sync node: 2 or more sync frames received</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNC_FRAMES_NOT_BELOW_MIN</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAMES_BELOW_MIN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFO</name>
              <description>Sync Frame Overflow
Set when either the number of sync frames received during the last communication cycle or the
total number of different sync frame IDs received during the last double cycle exceeds the maximum
number of sync frames as defined by GTUC2.SNM[3:0].
1 = More sync frames received than configured by GTUC2.SNM[3:0]
0 = Number of received sync frames &lt;= GTUC2.SNM[3:0]</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNC_FRAME_OVERFLOW</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAME_OVERFLOW</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCF</name>
              <description>Clock Correction Failure
This flag is set at the end of the cycle whenever one of the following errors occurred:
Missing offset and / or rate correction
Clock correction limit reached
The clock correction status is monitored in registers CCEV and SFS. A failure may occur during
startup, therefore bit CCF should be cleared by the Host after the CC entered
NORMAL_ACTIVE state.
1 = Clock correction failed
0 = No clock correction error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLK_CORRECTION_ERR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_CORRECTION_ERR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCL</name>
              <description>CHI Command Locked
The flag signals that the write access to the CHI command vector SUCC1.CMD[3:0] was not
successful because the execution of the previous CHI command has not yet completed. In this
case bit CNA is also set to '1'.
1 = CHI command not accepted
0 = CHI command accepted</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHI_CMD_ACCEPTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHI_CMD_NOT_ACCEPTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERR</name>
              <description>Parity Error
The flag signals a parity error to the Host. It is set whenever one of the flags MHDS.PIBF,
MHDS.POBF, MHDS.PMR, MHDS.PTBF1, MHDS.PTBF2 changes from '0' to '1'.
1 = Parity error detected
0 = No parity error detected</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PARITY_ERR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARITY_ERR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFO</name>
              <description>Receive FIFO Overrun
The flag is set by the CC when a receive FIFO overrun is detected. When a receive FIFO overrun
occurs, the oldest message is overwritten with the actual received message. The actual state of
the FIFO is monitored in register FSR.
1 = A receive FIFO overrun has been detected
0 = No receive FIFO overrun detected</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RECEIVE_FIFO_OVERRUN</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVE_FIFO_OVERRUN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFA</name>
              <description>Empty FIFO Access
This flag is set by the CC when the Host requests the transfer of a message from the receive
FIFO via Output Buffer while the receive FIFO is empty.
1 = Host access to empty FIFO occurred
0 = No Host access to empty FIFO occurred</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EMPTY_FIFO_ACCESS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY_FIFO_ACCESS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IIBA</name>
              <description>Illegal Input Buffer Access
This flag is set by the CC when the Host wants to modify a message buffer via Input Buffer and
one of the following conditions applies:
1) The CC is not in CONFIG or DEFAULT_CONFIG state and the Host writes to the Input
Buffer Command Request register to modify the
Header section of message buffer 0, 1 if configured for transmission in key slot
Header section of static message buffers with buffer number &lt; MRC.FDB[7:0]
while MRC.SEC[1:0] = '01'
Header section of any static or dynamic message buffer while MRC.SEC[1:0] = '1x'
Header and / or data section of any message buffer belonging to the receive FIFO
2) The Host writes to any register of the Input Buffer while IBCR.IBSYH is set to '1'.
1 = Illegal Host access to Input Buffer occurred
0 = No illegal Host access to Input Buffer occurred</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ILLEGAL_IBF_ACCESS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILLEGAL_IBF_ACCESS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOBA</name>
              <description>Illegal Output buffer Access
This flag is set by the CC when the Host requests the transfer of a message buffer from the Message
RAM to the Output Buffer while OBCR.OBSYS is set to '1'.
1 = Illegal Host access to Output Buffer occurred
0 = No illegal Host access to Output Buffer occurred</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ILLEGAL_OBF_ACCESS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILLEGAL_OBF_ACCESS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MHF</name>
              <description>Message Handler Constraints Flag
The flag signals a Message Handler constraints violation condition. It is set whenever one of the
flags MHDF.SNUA, MHDF.SNUB, MHDF.FNFA, MHDF.FNFB, MHDF.TBFA,
MHDF.TBFB, MHDF.WAHP changes from '0' to '1'.
1 = Message Handler failure detected
0 = No Message Handler failure detected</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MSG_HANDLER_FAIL_DETECT</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_HANDLER_FAIL_DETECT</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDA</name>
              <description>Error Detected on Channel A
This bit is set whenever one of the flags ACS.SEDA, ACS.CEDA, ACS.CIA, ACS.SBVA
changes from '0' to '1'.
1 = Error detected on channel A
0 = No error detected on channel A</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_A_ERR_DETECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_ERR_DETECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LTVA</name>
              <description>Latest Transmit Violation Channel A
The flag signals a latest transmit violation on channel A to the Host.
1 = Latest transmit violation detected on channel A
0 = No latest transmit violation detected on channel A</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_A_LATEST_TX_VIOLATION_DETECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_LATEST_TX_VIOLATION_DETECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TABA</name>
              <description>Transmission Across Boundary Channel A
The flag signals to the Host that a transmission across a slot boundary occurred for channel A.
1 = Transmission across slot boundary detected on channel A
0 = No transmission across slot boundary detected on channel A</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_A_TX_ACROSS_SLOT_BOUND_DETECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_TX_ACROSS_SLOT_BOUND_DETECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDB</name>
              <description>Error Detected on Channel B
This bit is set whenever one of the flags ACS.SEDB, ACS.CEDB, ACS.CIB, ACS.SBVB
changes from '0' to '1'.
1 = Error detected on channel B
0 = No error detected on channel B</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_B_ERR_DETECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_ERR_DETECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LTVB</name>
              <description>Latest Transmit Violation Channel B
The flag signals a latest transmit violation on channel B to the Host.
1 = Latest transmit violation detected on channel B
0 = No latest transmit violation detected on channel B</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_B_LATEST_TX_VIOLATION_DETECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_LATEST_TX_VIOLATION_DETECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TABB</name>
              <description>Transmission Across Boundary Channel B
The flag signals to the Host that a transmission across a slot boundary occurred for channel B.
1 = Transmission across slot boundary detected on channel B
0 = No transmission across slot boundary detected on channel B</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_B_TX_ACROSS_SLOT_BOUND_DETECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_TX_ACROSS_SLOT_BOUND_DETECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
