RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>SIR</name>
          <description>Status Interrupt Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x303FFFF</resetMask>
          <fields>
            <field>
              <name>WST</name>
              <description>Wakeup Status
This flag is set when CCSV.WSV[2:0] changes to a value other than UNDEFINED.
1 = Wakeup status changed
0 = Wakeup status unchanged</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKEUP_STATUS_UNCHANGED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_STATUS_CHANGED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAS</name>
              <description>Collision Avoidance Symbol
This flag is set by the CC during STARTUP state when a CAS or a potential CAS was received.
1 = Bit pattern matching the CAS symbol received
0 = No bit pattern matching the CAS symbol received</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CAS_BIT_PATTERN_MATCH</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAS_BIT_PATTERN_MATCH</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCS</name>
              <description>Cycle Start Interrupt
This flag is set by the CC when a communication cycle starts.
1 = Communication cycle started
0 = No communication cycle started</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMM_CYCLE_STARTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMM_CYCLE_STARTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXI</name>
              <description>Transmit Interrupt
This flag is set by the CC at the end of frame transmission if bit MBI in the respective message
buffer is set to '1' (see Table 17).
1 = At least one frame was transmitted from a transmit buffer with MBI = '1'
0 = No frame transmitted from a transmit buffer with MBI = '1'</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FRAME_TXED_FROM_TX_MBI_BUFF</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_TXED_FROM_TX_MBI_BUFF</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXI</name>
              <description>Receive Interrupt
This flag is set by the CC whenever the set condition of a message buffers ND flag is fulfilled
see 4.8.6 New Data 1/2/3/4 (NDAT1/2/3/4)), and if bit MBI of that message buffer is set to '1'
see Table 17).
1 = At least one ND flag of a receive buffer with MBI = '1' has been set to '1'
0 = No ND flag of a receive buffer with MBI = '1' has been set to '1'</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ND_FLAG_OF_RX_MBI_BUFF_SET</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ND_FLAG_OF_RX_MBI_BUFF_SET</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFNE</name>
              <description>Receive FIFO Not Empty
This flag is set by the CC when a received valid frame was stored into the empty receive FIFO.
The actual state of the receive FIFO is monitored in register FSR.
1 = Receive FIFO is not empty
0 = Receive FIFO is empty</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FIFO_EMPTY</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FIFO_NOT_EMPTY</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFCL</name>
              <description>Receive FIFO Critical Level
This flag is set when the receive FIFO fill level FSR.RFFL[7:0] is equal or greater than the critical
level as configured by FCL.CL[7:0].
1 = Receive FIFO critical level reached
0 = Receive FIFO below critical level</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FIFO_BELOW_CRITICAL_LEVEL</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FIFO_NOT_BELOW_CRITICAL_LEVEL</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMVC</name>
              <description>Network Management Vector Changed
This interrupt flag signals a change in the Network Management Vector visible to the Host.
1 = Network management vector changed
0 = No change in the network management vector</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NTWK_MGMT_VECTOR_UNCHANGED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTWK_MGMT_VECTOR_CHANGED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TI0</name>
              <description>Timer Interrupt 0
This flag is set whenever timer 0 matches the conditions configured in register T0C. A Timer
Interrupt 0 is also signalled on pin eray_tint0.
1 = Timer Interrupt 0 occurred
0 = No Timer Interrupt 0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIMER_INTERRUPT_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_INTERRUPT_0_OCCURED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TI1</name>
              <description>Timer Interrupt 1
This flag is set whenever timer 1 matches the conditions configured in register T1C. A Timer
Interrupt 1 is also signalled on pin eray_tint1.
1 = Timer Interrupt 1 occurred
0 = No Timer Interrupt 1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIMER_INTERRUPT_1</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_INTERRUPT_1_OCCURED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIBC</name>
              <description>Transfer Input Buffer Completed
This flag is set whenever a transfer from Input Buffer to the Message RAM has completed and
IBCR.IBSYS has been reset by the Message Handler.
1 = Transfer between Input Buffer and Message RAM completed
0 = No transfer completed</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRANSFER_COMPLETED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBF_TO_MSGRAM_TRANSFER_COMPLETED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOBC</name>
              <description>Transfer Output Buffer Completed
This flag is set whenever a transfer from the Message RAM to the Output Buffer has completed
and OBCR.OBSYS has been reset by the Message Handler.
1 = Transfer between Message RAM and Output Buffer completed
0 = No transfer completed</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRANSFER_COMPLETED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSGRAM_TO_OBF_TRANSFER_COMPLETED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWE</name>
              <description>Stop Watch Event
This flag is set after a stop watch activation when the actual cycle counter and macrotick value
are stored in the Stop Watch register (see [01]Section 4.4.10 Stop Watch Register 1 (STPW1)).
1 = Stop Watch Event occurred
0 = No Stop Watch Event</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_STOP_WATCH_EVENT</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_WATCH_EVENT_OCCURRED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUCS</name>
              <description>Startup Completed Successfully
This flag is set whenever a startup completed successfully and the CC entered
NORMAL_ACTIVE state.
1 = Startup completed successfully
0 = No startup completed successfully</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_STARTUP_COMPLETED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STARTUP_COMPLETED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSI</name>
              <description>Message Buffer Status Interrupt
This flag is set by the CC when the message buffer status MBS has changed and if bit MBI of
that message buffer is set (see Table 17).
1 = Message buffer status of at least one message buffer with MBI = '1' has changed
0 = No message buffer status change of message buffer with MBI = '1'</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MSG_BUFF_STATUS_CHANGED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_BUFF_STATUS_CHANGED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDS</name>
              <description>Start of Dynamic Segment
This flag is set by the CC when the dynamic segment starts.
1 = Dynamic segment started
0 = Dynamic segment not yet started</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DYNAMIC_SEGMENT_NOT_STARTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DYNAMIC_SEGMENT_STARTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPA</name>
              <description>Wakeup Pattern Channel A
This flag is set by the CC when a wakeup pattern was received on channel A. Only set when the
CC is in WAKEUP, READY, or STARTUP state, or when in Monitor mode.
1 = Wakeup pattern received on channel A
0 = No wakeup pattern received on channel A</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAKEUP_PATTERN_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_PATTERN_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTSA</name>
              <description>MTS Received on Channel A (vSS!ValidMTSA)
Media Access Test symbol received on channel A during the preceding symbol window.
Updated by the CC for each channel at the end of the symbol window.
1 = MTS symbol received on channel A
0 = No MTS symbol received on channel A</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MTS_SYMBOL_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTS_SYMBOL_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPB</name>
              <description>Wakeup Pattern Channel B
This flag is set by the CC when a wakeup pattern was received on channel B. Only set when the
CC is in WAKEUP, READY, or STARTUP state, or when in Monitor mode.
1 = Wakeup pattern received on channel B
0 = No wakeup pattern received on channel B</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAKEUP_PATTERN_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_PATTERN_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTSB</name>
              <description>MTS Received on Channel B (vSS!ValidMTSB)
Media Access Test symbol received on channel B during the preceding symbol window.
Updated by the CC for each channel at the end of the symbol window.
1 = MTS symbol received on channel B
0 = No MTS symbol received on channel B</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MTS_SYMBOL_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTS_SYMBOL_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EILS</name>
          <description>Error Interrupt Line Select</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7070FFF</resetMask>
          <fields>
            <field>
              <name>PEMCL</name>
              <description>POC Error Mode Changed Interrupt Line</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAL</name>
              <description>Command Not Accepted Interrupt Line</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFBML</name>
              <description>Sync Frames Below Minimum Interrupt Line</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFOL</name>
              <description>Sync Frame Overflow Interrupt Line</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCFL</name>
              <description>Clock Correction Failure Interrupt Line</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLL</name>
              <description>CHI Command Locked Interrupt Line</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERRL</name>
              <description>Parity Error Interrupt Line</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOL</name>
              <description>Receive FIFO Overrun Interrupt Line</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EFAL</name>
              <description>Empty FIFO Access Interrupt Line</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IIBAL</name>
              <description>Illegal Input Buffer Access Interrupt Line</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IOBAL</name>
              <description>Illegal Output Buffer Access Interrupt Line</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MHFL</name>
              <description>Message Handler Constraints Flag Interrupt Line</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDAL</name>
              <description>Error Detected on Channel A Interrupt Line</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTVAL</name>
              <description>Latest Transmit Violation Channel A Interrupt Line</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TABAL</name>
              <description>Transmission Across Boundary Channel A Interrupt Line</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDBL</name>
              <description>Error Detected on Channel B Interrupt Line</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTVBL</name>
              <description>Latest Transmit Violation Channel B Interrupt Line</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TABBL</name>
              <description>Transmission Across Boundary Channel B Interrupt Line</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
