RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>SILS</name>
          <description>Status Interrupt Line Select</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x303FFFF</resetValue>
          <resetMask>0x303FFFF</resetMask>
          <fields>
            <field>
              <name>WSTL</name>
              <description>Wakeup Status Interrupt Line</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CASL</name>
              <description>Collision Avoidance Symbol Interrupt Line</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCSL</name>
              <description>Cycle Start Interrupt Line</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXIL</name>
              <description>Transmit Interrupt Line</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXIL</name>
              <description>Receive Interrupt Line</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFNEL</name>
              <description>Receive FIFO Not Empty Interrupt Line</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCLL</name>
              <description>Receive FIFO Critical Level Interrupt Line</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NMVCL</name>
              <description>Network Management Vector Changed Interrupt Line</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI0L</name>
              <description>Timer Interrupt 0 Line</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI1L</name>
              <description>Timer Interrupt 1 Line</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIBCL</name>
              <description>Transfer Input Buffer Completed Interrupt Line</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOBCL</name>
              <description>Transfer Output Buffer Completed Interrupt Line</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWEL</name>
              <description>Stop Watch Event Interrupt Line</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUCSL</name>
              <description>Startup Completed Successfully Interrupt Line</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MBSIL</name>
              <description>Message Buffer Status Interrupt Line</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDSL</name>
              <description>Start of Dynamic Segment Interrupt Line</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPAL</name>
              <description>Wakeup Pattern Channel A Interrupt Line</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTSAL</name>
              <description>Media Access Test Symbol Channel A Interrupt Line</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPBL</name>
              <description>Wakeup Pattern Channel B Interrupt Line</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTSBL</name>
              <description>Media Access Test Symbol Channel B Interrupt Line</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EIES</name>
          <description>Error Interrupt Enable Set</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7070FFF</resetMask>
          <fields>
            <field>
              <name>PEMCE</name>
              <description>POC Error Mode Changed Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAE</name>
              <description>Command Not Accepted Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFBME</name>
              <description>Sync Frames Below Minimum Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFOE</name>
              <description>Sync Frame Overflow Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCFE</name>
              <description>Clock Correction Failure Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLE</name>
              <description>CHI Command Locked Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERRE</name>
              <description>Parity Error Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOE</name>
              <description>Receive FIFO Overrun Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EFAE</name>
              <description>Empty FIFO Access Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IIBAE</name>
              <description>Illegal Input Buffer Access Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IOBAE</name>
              <description>Illegal Output Buffer Access Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MHFE</name>
              <description>Message Handler Constraints Flag Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDAE</name>
              <description>Error Detected on Channel A Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTVAE</name>
              <description>Latest Transmit Violation Channel A Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TABAE</name>
              <description>Transmission Across Boundary Channel A Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDBE</name>
              <description>Error Detected on Channel B Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTVBE</name>
              <description>Latest Transmit Violation Channel B Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TABBE</name>
              <description>Transmission Across Boundary Channel B Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EIER</name>
          <description>Error Interrupt Enable Reset</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7070FFF</resetMask>
          <fields>
            <field>
              <name>PEMCE</name>
              <description>POC Error Mode Changed Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAE</name>
              <description>Command Not Accepted Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFBME</name>
              <description>Sync Frames Below Minimum Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFOE</name>
              <description>Sync Frame Overflow Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCFE</name>
              <description>Clock Correction Failure Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLE</name>
              <description>CHI Command Locked Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERRE</name>
              <description>Parity Error Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFOE</name>
              <description>Receive FIFO Overrun Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EFAE</name>
              <description>Empty FIFO Access Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IIBAE</name>
              <description>Illegal Input Buffer Access Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IOBAE</name>
              <description>Illegal Output Buffer Access Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MHFE</name>
              <description>Message Handler Constraints Flag Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDAE</name>
              <description>Error Detected on Channel A Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTVAE</name>
              <description>Latest Transmit Violation Channel A Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TABAE</name>
              <description>Transmission Across Boundary Channel A Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDBE</name>
              <description>Error Detected on Channel B Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTVBE</name>
              <description>Latest Transmit Violation Channel B Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TABBE</name>
              <description>Transmission Across Boundary Channel B Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIES</name>
          <description>Status Interrupt Enable Set</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x303FFFF</resetMask>
          <fields>
            <field>
              <name>WSTE</name>
              <description>Wakeup Status Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CASE</name>
              <description>Collision Avoidance Symbol Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCSE</name>
              <description>Cycle Start Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXIE</name>
              <description>Receive Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFNEE</name>
              <description>Receive FIFO Not Empty Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCLE</name>
              <description>Receive FIFO Critical Level Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NMVCE</name>
              <description>Network Management Vector Changed Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI0E</name>
              <description>Timer Interrupt 0 Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI1E</name>
              <description>Timer Interrupt 1 Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIBCE</name>
              <description>Transfer Input Buffer Completed Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOBCE</name>
              <description>Transfer Output Buffer Completed Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWEE</name>
              <description>Stop Watch Event Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUCSE</name>
              <description>Startup Completed Successfully Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MBSIE</name>
              <description>Message Buffer Status Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDSE</name>
              <description>Start of Dynamic Segment Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPAE</name>
              <description>Wakeup Pattern Channel A Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTSAE</name>
              <description>MTS Received on Channel A Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPBE</name>
              <description>Wakeup Pattern Channel B Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTSBE</name>
              <description>MTS Received on Channel B Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
