RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>SIER</name>
          <description>Status Interrupt Enable Reset</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x303FFFF</resetMask>
          <fields>
            <field>
              <name>WSTE</name>
              <description>Wakeup Status Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CASE</name>
              <description>Collision Avoidance Symbol Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCSE</name>
              <description>Cycle Start Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXIE</name>
              <description>Receive Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFNEE</name>
              <description>Receive FIFO Not Empty Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCLE</name>
              <description>Receive FIFO Critical Level Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NMVCE</name>
              <description>Network Management Vector Changed Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI0E</name>
              <description>Timer Interrupt 0 Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI1E</name>
              <description>Timer Interrupt 1 Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIBCE</name>
              <description>Transfer Input Buffer Completed Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOBCE</name>
              <description>Transfer Output Buffer Completed Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWEE</name>
              <description>Stop Watch Event Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUCSE</name>
              <description>Startup Completed Successfully Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MBSIE</name>
              <description>Message Buffer Status Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDSE</name>
              <description>Start of Dynamic Segment Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPAE</name>
              <description>Wakeup Pattern Channel A Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTSAE</name>
              <description>MTS Received on Channel A Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPBE</name>
              <description>Wakeup Pattern Channel B Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTSBE</name>
              <description>MTS Received on Channel B Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ILE</name>
          <description>Interrupt Line Enable</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>EINT0_</name>
              <description>Enable Interrupt Line 0
1 = Interrupt line eray_int0 enabled
0 = Interrupt line eray_int0 disabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_INT0_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_INT0_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EINT1_</name>
              <description>Enable Interrupt Line 1
1 = Interrupt line eray_int1 enabled
0 = Interrupt line eray_int1 disabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERAY_INT1_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERAY_INT1_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>T0C</name>
          <description>Timer 0 Configuration</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFF7F03</resetMask>
          <fields>
            <field>
              <name>T0RC</name>
              <description>Timer 0 Run Control
1 = Timer 0 running
0 = Timer 0 halted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_0_HALTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_0_RUNNING</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T0MS</name>
              <description>Timer 0 Mode Select
1 = Continuous mode
0 = Single-shot mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_0_SINGLE_SHOT_MODE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_0_CONTINUOUS_MODE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T0CC</name>
              <description>Timer 0 Cycle Code
The 7-bit timer 0 cycle code determines the cycle set used for generation of the timer 0 interrupt.
For details about the configuration of the cycle code see [01]Section 5.7.2 Cycle Counter Filtering.</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>T0MO</name>
              <description>Timer 0 Macrotick Offset
Configures the macrotick offset from the beginning of the cycle where the interrupt is to occur.
The Timer 0 Interrupt occurs at this offset for each cycle of the cycle set.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1C</name>
          <description>Timer 1 Configuration</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0x3FFF0003</resetMask>
          <fields>
            <field>
              <name>T1RC</name>
              <description>Timer 1 Run Control
1 = Timer 1 running
0 = Timer 1 halted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_1_HALTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_1_RUNNING</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T1MS</name>
              <description>Timer 1 Mode Select
1 = Continuous mode
0 = Single-shot mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_1_SINGLE_SHOT_MODE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_1_CONTINUOUS_MODE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T1MC</name>
              <description>Timer 1 Macrotick Count
When the configured macrotick count is reached the timer 1 interrupt is generated.
Valid values are: 2 to 16383 MT in continuous mode
1 to 16383 MT in single-shot mode</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STPW1</name>
          <description>Stop Watch Register 1</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFF3F7F</resetMask>
          <fields>
            <field>
              <name>ESWT</name>
              <description>Enable Stop Watch Trigger
If enabled an edge on input eray_stpwt or an interrupt 0,1 event (rising edge on pin eray_int0
or eray_int1) activates the stop watch. In single-shot mode this bit is reset to '0' after the actual
cycle counter and macrotick value are stored in the Stop Watch register.
1 = Stop watch trigger enabled
0 = Stop watch trigger disabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_WATCH_TRIGGER_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_WATCH_TRIGGER_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWMS</name>
              <description>Stop Watch Mode Select
1 = Continuous mode
0 = Single-shot mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_WATCH_SINGLE_SHOT_MODE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_WATCH_CONTINUOUS_MODE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Stop Watch Trigger Edge Select
1 = Rising edge
0 = Falling edge</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_WATCH_FALLING_EDGE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_WATCH_RISING_EDGE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSWT</name>
              <description>Software Stop Watch Trigger
When the Host writes this bit to '1' the stop watch is activated. After the actual cycle counter
and macrotick value are stored in the Stop Watch register this bit is reset to '0'. The bit is only
writeable while ESWT = '0'.
1 = Stop watch activated by software trigger
0 = Software trigger reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_WATCH_SOFTWARE_TRIGGER_RESET</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_WATCH_SOFTWARE_TRIGGER_ACTIVATED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EETP</name>
              <description>Enable External Trigger Pin
Enables stop watch trigger event via pin eray_stpwt if ESWT = '1'.
1 = Edge on pin eray_stpwt triggers stop watch
0 = Stop watch trigger via pin eray_stpwt disabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESTPWT_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESTPWT_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EINT0</name>
              <description>Enable Interrupt 0 Trigger
Enables stop watch trigger by interrupt 0 event if ESWT = '1'.
1 = Interrupt 0 event triggers stop watch
0 = Stop watch trigger by interrupt 0 disabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STPWT_TRIGGER_BY_INT0_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STPWT_TRIGGER_BY_INT0_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EINT1</name>
              <description>Enable Interrupt 1 Trigger
Enables stop watch trigger by interrupt 1event if ESWT = '1'.
1 = Interrupt 1 event triggers stop watch
0 = Stop watch trigger by interrupt 1 disabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STPWT_TRIGGER_BY_INT1_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STPWT_TRIGGER_BY_INT1_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCCV</name>
              <description>Stop Watch Captured Cycle Counter Value
State of the cycle counter when the stop watch event occurred. Valid values are 0 to 63.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SMTV</name>
              <description>Stop Watch Captured Macrotick Value
State of the macrotick counter when the stop watch event occurred. Valid values are 0 to 15999.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STPW2</name>
          <description>Stop Watch Register 2</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF07FF</resetMask>
          <fields>
            <field>
              <name>SSCVA</name>
              <description>Stop Watch Captured Slot Counter Value Channel A
State of the slot counter for channel A when the stop watch event occurred. Valid values are 0 to
2047.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SSCVB</name>
              <description>Stop Watch Captured Slot Counter Value Channel B
State of the slot counter for channel B when the stop watch event occurred. Valid values are 0 to
2047.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
