RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>SUCC1</name>
          <description>SUC Configuration Register 1</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC401080</resetValue>
          <resetMask>0xFFFFB8F</resetMask>
          <fields>
            <field>
              <name>CMD</name>
              <description>N/A</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_NOT_ACCEPTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_SLOTS</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>N/A</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_MTS</name>
                  <description>N/A</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLOW_COLDSTART</name>
                  <description>N/A</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_STATUS_INDICATORS</name>
                  <description>N/A</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONITOR_MODE</name>
                  <description>N/A</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_RAMS</name>
                  <description>N/A</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBSY</name>
              <description>POC Busy
Signals that the POC is busy and cannot accept a command from the Host. CMD[3:0] is locked
against write accesses. Set to '1' after hard reset during initialization of internal RAM blocks.
1 = POC is busy, CMD[3:0] locked
0 = POC not busy, CMD[3:0] writeable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POC_NOT_BUSY</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POC_BUSY</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXST</name>
              <description>Transmit Startup Frame in Key Slot (pKeySlotUsedForStartup)
Defines whether the key slot is used to transmit startup frames. The bit can be modified in
DEFAULT_CONFIG or CONFIG state only.
1 = Key slot used to transmit startup frame, node is leading or following coldstarter
0 = No startup frame transmission in key slot, node is non-coldstarter</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_STARTUP_FRAME_TXMN</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STARTUP_FRAME_TXMN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSY</name>
              <description>Transmit Sync Frame in Key Slot (pKeySlotUsedForSync)
Defines whether the key slot is used to transmit sync frames. The bit can be modified in
DEFAULT_CONFIG or CONFIG state only.
1 = Key slot used to transmit sync frame, node is sync node
0 = No sync frame transmission in key slot, node is neither sync nor coldstart node</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNC_FRAME_TXMN</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAME_TXMN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSA</name>
              <description>Cold Start Attempts (gColdStartAttempts)
Configures the maximum number of attempts that a cold starting node is permitted to try to start
up the network without receiving any valid response from another node. It can be modified in
DEFAULT_CONFIG or CONFIG state only. Must be identical in all nodes of a cluster. Valid
values are 2 to 31.</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTA</name>
              <description>Passive to Active (pAllowPassiveToActive)
Defines the number of consecutive even / odd cycle pairs that must have valid clock correction
terms before the CC is allowed to transit from NORMAL_PASSIVE to NORMAL_ACTIVE
state. If set to '00000' the CC is not allowed to transit from NORMAL_PASSIVE to
NORMAL_ACTIVE state. It can be modified in DEFAULT_CONFIG or CONFIG state only.
Valid values are 0 to 31 even / odd cycle pairs.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUCS</name>
              <description>Wakeup Channel Select (pWakeupChannel)
With this bit the Host selects the channel on which the CC sends the Wakeup pattern. The CC
ignores any attempt to change the status of this bit when not in DEFAULT_CONFIG or CONFIG
state.
1 = Send wakeup pattern on channel B
0 = Send wakeup pattern on channel A</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEND_WKUP_PATTERN_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_WKUP_PATTERN_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM</name>
              <description>Transmission Slot Mode (pSingleSlotEnabled)
Selects the initial transmission slot mode. In SINGLE slot mode the CC may only transmit in the
preconfigured key slot. The key slot ID is configured in the header section of message buffer 0
respectively message buffers 0 and 1 depending on bit MRC.SPLM. In case TSM = '1', message
buffer 0 respectively message buffers 0,1 can be (re)configured in DEFAULT_CONFIG or
CONFIG state only. In ALL slot mode the CC may transmit in all slots. TSM is a configuration
bit which can only be set / reset by the Host. The bit can be written in DEFAULT_CONFIG or
CONFIG state only. The CC changes to ALL slot mode when the Host successfully applied the
ALL_SLOTS command by writing CMD[3:0] = '0101' in POC states NORMAL_ACTIVE or
NORMAL_PASSIVE. The actual slot mode is monitored by CCSV.SLM[1:0].
1 = SINGLE Slot Mode (default after hard reset)
0 = ALL Slot Mode</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_SLOT_MODE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_SLOT_MODE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCSE</name>
              <description>Halt due to Clock Sync Error (pAllowHaltDueToClock)
Controls the transition to HALT state due to a clock synchronization error. The bit can be modified
in DEFAULT_CONFIG or CONFIG state only.
1 = CC will enter HALT state
0 = CC will enter / remain in NORMAL_PASSIVE</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CC_TO_ENTER_NORMAL_PASSIVE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC_TO_ENTER_HALT</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTSA_</name>
              <description>Select Channel A for MTS Transmission
The bit selects channel A for MTS symbol transmission. The flag is reset by default and may be
modified only in DEFAULT_CONFIG or CONFIG state.
1 = Channel A selected for MTS transmission
0 = Channel A disabled for MTS transmission</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_DISABLED_FOR_MTS_TXMN</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_SELECTED_FOR_MTS_TXMN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTSB_</name>
              <description>Select Channel B for MTS Transmission
The bit selects channel B for MTS symbol transmission. The flag is reset by default and may be
modified only in DEFAULT_CONFIG or CONFIG state.
1 = Channel B selected for MTS transmission
0 = Channel B disabled for MTS transmission</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_DISABLED_FOR_MTS_TXMN</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_SELECTED_FOR_MTS_TXMN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCHA</name>
              <description>Connected to Channel A (pChannels)
Configures whether the node is connected to channel A.
1 = Node connected to channel A (default after hard reset)
0 = Not connected to channel A</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_NOT_CONNECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_CONNECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCHB</name>
              <description>Connected to Channel B (pChannels)
Configures whether the node is connected to channel B.
1 = Node connected to channel B (default after hard reset)
0 = Not connected to channel B</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_NOT_CONNECTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_CONNECTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUCC2</name>
          <description>SUC Configuration Register 2</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000504</resetValue>
          <resetMask>0xF1FFFFF</resetMask>
          <fields>
            <field>
              <name>LT</name>
              <description>Listen Timeout (pdListenTimeout)
Configures wakeup / startup listen timeout in uT. The range for pdListenTimeout is 1284 to
1283846 uT.</description>
              <bitRange>[20:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LTN</name>
              <description>Listen Timeout Noise (gListenNoise - 1)
Configures the upper limit for startup and wakeup listen timeout in the presence of noise
expressed as a multiple of pdListenTimeout. The range for gListenNoise is 2 to 16. LTN[3:0]
must be configured identical in all nodes of a cluster.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUCC3</name>
          <description>SUC Configuration Register 3</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WCP</name>
              <description>Maximum Without Clock Correction Passive (gMaxWithoutClockCorrectionPassive)
Defines the number of consecutive even / odd cycle pairs with missing clock correction terms
that will cause a transition from NORMAL_ACTIVE to NORMAL_PASSIVE state. Must be
identical in all nodes of a cluster. Valid values are 1 to 15 cycle pairs.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCF</name>
              <description>Maximum Without Clock Correction Fatal (gMaxWithoutClockCorrectionFatal)
Defines the number of consecutive even / odd cycle pairs with missing clock correction terms
that will cause a transition from NORMAL_ACTIVE or NORMAL_PASSIVE to HALT state.
Must be identical in all nodes of a cluster. Valid values are 1 to 15 cycle pairs.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NEMC</name>
          <description>NEM Configuration Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>NML</name>
              <description>Network Management Vector Length (gNetworkManagementVectorLength)
These bits configure the length of the NM vector. The configured length must be identical in all
nodes of a cluster. Valid values are 0 to 12 bytes.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
