RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>PRTC1</name>
          <description>PRT Configuration Register 1</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x84C0633</resetValue>
          <resetMask>0xFDFFF7FF</resetMask>
          <fields>
            <field>
              <name>TSST</name>
              <description>Transmission Start Sequence Transmitter (gdTSSTransmitter)
Configures the duration of the Transmission Start Sequence (TSS) in terms of bit times (1 bit
time = 4 uT = 100ns@10Mbps). Must be identical in all nodes of a cluster. Valid values are 3 to
15 bit times.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASM</name>
              <description>Collision Avoidance Symbol Max (gdCASRxLowMax)
Configures the upper limit of the acceptance window for a collision avoidance symbol (CAS).
CASM6 is fixed to '1'. Valid values are 67 to 99 bit times, corresponding to a CASM range (without CASM6) of 3 to 35.</description>
              <bitRange>[9:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>35</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASM6</name>
              <description>Part of CASM[6:0], but fixed to 1</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPP</name>
              <description>Strobe Point Position
Defines the sample count value for strobing. The strobed bit value is set to the voted value when
the sample count is incremented to the value configured by SPP[1:0].
00, 11= Sample 5 (default)
01 = Sample 4
10 = Sample 6</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_5</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5_MIRROR</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_4</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_6</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRP</name>
              <description>Baud Rate Prescaler (gdSampleClockPeriod, pSamplesPerMicrotick)
The Baud Rate Prescaler configures the baud rate on the FlexRay bus. The baud rates listed
below are valid with a sample clock eray_sclk = 80 MHz. One bit time always consists of 8
samples independent of the configured baud rate.
00       =  10 MBit/s (default)
                gdSampleClockPeriod = 12.5 ns = 1 - eray_sclk
                pSamplesPerMicrotick = 2 (1 uT = 25 ns)
01       =  5 MBit/s
                gdSampleClockPeriod = 25 ns = 2 - eray_sclk
                pSamplesPerMicrotick = 1 (1 uT = 25 ns)
10, 11 = 2.5 MBit/s
                gdSampleClockPeriod = 50 ns = 4 - eray_sclk
                pSamplesPerMicrotick = 1 (1 uT = 50 ns)</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BAUD_10_MBPS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAUD_5_MBPS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAUD_2P5_MBPS</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAUD_2P5_MBPS_MIRROR</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXW</name>
              <description>Wakeup Symbol Receive Window Length (gdWakeupSymbolRxWindow)
Configures the number of bit times used by the node to test the duration of the received wakeup
pattern. Must be identical in all nodes of a cluster. Valid values are 76 to 301 bit times.</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWP</name>
              <description>Repetitions of Tx Wakeup Pattern (pWakeupPattern)
Configures the number of repetitions (sequences) of the Tx wakeup symbol. Valid values are 2
to 63.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRTC2</name>
          <description>PRT Configuration Register 2</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF2D0A0E</resetValue>
          <resetMask>0x3FFF3F3F</resetMask>
          <fields>
            <field>
              <name>RXI_</name>
              <description>Wakeup Symbol Receive Idle (gdWakeupSymbolRxIdle)
Configures the number of bit times used by the node to test the duration of the idle phase of the
received wakeup symbol. Must be identical in all nodes of a cluster. Valid values are 14 to 59 bit
times.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>59</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXL</name>
              <description>Wakeup Symbol Receive Low (gdWakeupSymbolRxLow)
Configures the number of bit times used by the node to test the duration of the low phase of the
received wakeup symbol. Must be identical in all nodes of a cluster. Valid values are 10 to 55 bit
times.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXI_</name>
              <description>Wakeup Symbol Transmit Idle (gdWakeupSymbolTxIdle)
Configures the number of bit times used by the node to transmit the idle phase of the wakeup
symbol. Must be identical in all nodes of a cluster. Valid values are 45 to 180 bit times.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXL</name>
              <description>Wakeup Symbol Transmit Low (gdWakeupSymbolTxLow)
Configures the number of bit times used by the node to transmit the low phase of the
wakeup symbol. Must be identical in all nodes of a cluster. Valid values are 15 to 60 bit times.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>60</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MHDC</name>
          <description>MHD Configuration Register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFF007F</resetMask>
          <fields>
            <field>
              <name>SFDL</name>
              <description>Static Frame Data Length (gPayloadLengthStatic)
Configures the cluster-wide payload length for all frames sent in the static segment in double
bytes. The payload length must be identical in all nodes of a cluster. Valid values are 0 to 127.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLT</name>
              <description>Start of Latest Transmit (pLatestTx)
Configures the maximum minislot value allowed before inhibiting frame transmission in the
dynamic segment of the cycle. There is no transmission in dynamic segment if SLT[12:0] is set
to zero. Valid values are 0 to 7981 minislots.</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC1</name>
          <description>GTU Configuration Register 1</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x280</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>UT</name>
              <description>Microtick per Cycle (pMicroPerCycle)
Configures the duration of the communication cycle in microticks. Valid values are 640 to
640000 uT.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC2</name>
          <description>GTU Configuration Register 2</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000A</resetValue>
          <resetMask>0xF3FFF</resetMask>
          <fields>
            <field>
              <name>MPC</name>
              <description>Macrotick Per Cycle (gMacroPerCycle)
Configures the duration of one communication cycle in macroticks. The cycle length must be
identical in all nodes of a cluster. Valid values are 10 to 16000 MT.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SNM</name>
              <description>Sync Node Max (gSyncNodeMax)
Maximum number of frames within a cluster with sync frame indicator bit SYN set to '1'. Must
be identical in all nodes of a cluster. Valid values are 2 to 15.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC3</name>
          <description>GTU Configuration Register 3</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2020000</resetValue>
          <resetMask>0x7F7FFFFF</resetMask>
          <fields>
            <field>
              <name>UIOA</name>
              <description>Microtick Initial Offset Channel A (pMicroInitialOffset[A])
Configures the number of microticks between the actual time reference point on channel A and
the subsequent macrotick boundary of the secondary time reference point. The parameter
depends on pDelayCompensation[A] and therefore has to be set for each channel independently.
Valid values are 0 to 240 uT.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UIOB</name>
              <description>Microtick Initial Offset Channel B (pMicroInitialOffset[B])
Configures the number of microticks between the actual time reference point on channel B and
the subsequent macrotick boundary of the secondary time reference point. The parameter
depends on pDelayCompensation[B] and therefore has to be set for each channel independently.
Valid values are 0 to 240 uT.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIOA</name>
              <description>Macrotick Initial Offset Channel A (pMacroInitialOffset[A])
Configures the number of macroticks between the static slot boundary and the subsequent macrotick
boundary of the secondary time reference point based on the nominal macrotick duration.
Must be identical in all nodes of a cluster. Valid values are 2 to 72 MT.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIOB</name>
              <description>Macrotick Initial Offset Channel B (pMacroInitialOffset[B])
Configures the number of macroticks between the static slot boundary and the subsequent macrotick
boundary of the secondary time reference point based on the nominal macrotick duration.
Must be identical in all nodes of a cluster. Valid values are 2 to 72 MT.</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC4</name>
          <description>GTU Configuration Register 4</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80007</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>NIT</name>
              <description>Network Idle Time Start (gMacroPerCycle - gdNIT - 1)
Configures the starting point of the Network Idle Time NIT at the end of the communication
cycle expressed in terms of macroticks from the beginning of the cycle. The start of NIT is recognized
if Macrotick = gMacroPerCycle - gdNIT -1 and the increment pulse of Macrotick is set.
Must be identical in all nodes of a cluster. Valid values are 7 to 15997 MT.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCS</name>
              <description>Offset Correction Start (gOffsetCorrectionStart - 1)
Determines the start of the offset correction within the NIT phase, calculated from start of cycle.
Must be identical in all nodes of a cluster. For cluster consisting of E-Ray implementations only,
it is sufficient to program OCS = NIT + 1. Valid values are 8 to 15998 MT.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC5</name>
          <description>GTU Configuration Register 5</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE000000</resetValue>
          <resetMask>0xFF1FFFFF</resetMask>
          <fields>
            <field>
              <name>DCA</name>
              <description>Delay Compensation Channel A (pDelayCompensation[A])
Used to compensate for reception delays on the indicated channel. This covers assumed propagation
delay up to cPropagationDelayMax for microticks in the range of 0.0125 to 0.05us. In
practice, the minimum of the propagation delays of all sync nodes should be applied.
Valid values are 0 to 200 uT.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCB</name>
              <description>Delay Compensation Channel B (pDelayCompensation[B])
Used to compensate for reception delays on the indicated channel. This covers assumed propagation
delay up to cPropagationDelayMax for microticks in the range of 0.0125 to 0.05us. In
practice, the minimum of the propagation delays of all sync nodes should be applied.
Valid values are 0 to 200 uT.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CDD</name>
              <description>Cluster Drift Damping (pClusterDriftDamping)
Configures the cluster drift damping value used in clock synchronization to minimize accumulation
of rounding errors. Valid values are 0 to 20 uT.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEC</name>
              <description>Decoding Correction (pDecodingCorrection)
Configures the decoding correction value used to determine the primary time reference point.
Valid values are 14 to 143 uT.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC6</name>
          <description>GTU Configuration Register 6</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0x7FF07FF</resetMask>
          <fields>
            <field>
              <name>ASR</name>
              <description>Accepted Startup Range (pdAcceptedStartupRange)
Number of microticks constituting the expanded range of measured deviation for startup frames
during integration. Valid values are 0 to 1875 uT.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD</name>
              <description>Maximum Oscillator Drift (pdMaxDrift)
Maximum drift offset between two nodes that operate with unsynchronized clocks over one
communication cycle in uT. Valid values are 2 to 1923 uT.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC7</name>
          <description>GTU Configuration Register 7</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20004</resetValue>
          <resetMask>0x3FF03FF</resetMask>
          <fields>
            <field>
              <name>SSL</name>
              <description>Static Slot Length (gdStaticSlot)
Configures the duration of a static slot in macroticks. The static slot length must be identical in
all nodes of a cluster. Valid values are 4 to 659 MT.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSS</name>
              <description>Number of Static Slots (gNumberOfStaticSlots)
Configures the number of static slots in a cycle. At least 2 coldstart nodes must be configured to
startup a FlexRay network. The number of static slots must be identical in all nodes of a cluster.
Valid values are 2 to 1023.</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
