RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>GTUC8</name>
          <description>GTU Configuration Register 8</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x1FFF003F</resetMask>
          <fields>
            <field>
              <name>MSL</name>
              <description>Minislot Length (gdMinislot)
Configures the duration of a minislot in macroticks. The minislot length must be identical in all
nodes of a cluster. Valid values are 2 to 63 MT.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMS</name>
              <description>Number of Minislots (gNumberOfMinislots)
Configures the number of minislots within the dynamic segment of a cycle. The number of minislots
must be identical in all nodes of a cluster. Valid values are 0 to 7986.</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC9</name>
          <description>GTU Configuration Register 9</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x101</resetValue>
          <resetMask>0x31F3F</resetMask>
          <fields>
            <field>
              <name>APO</name>
              <description>Action Point Offset (gdActionPointOffset)
Configures the action point offset in macroticks within static slots and symbol window. Must be
identical in all nodes of a cluster. Valid values are 1 to 63 MT.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAPO</name>
              <description>Minislot Action Point Offset (gdMinislotActionPointOffset)
Configures the action point offset in macroticks within the minislots of the dynamic segment.
Must be identical in all nodes of a cluster. Valid values are 1 to 31 MT.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSI</name>
              <description>Dynamic Slot Idle Phase (gdDynamicSlotIdlePhase)
The duration of the dynamic slot idle phase has to be greater or equal than the idle detection
time. Must be identical in all nodes of a cluster. Valid values are 0 to 2 Minislot.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC10</name>
          <description>GTU Configuration Register 10</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20005</resetValue>
          <resetMask>0x7FF3FFF</resetMask>
          <fields>
            <field>
              <name>MOC</name>
              <description>Maximum Offset Correction (pOffsetCorrectionOut)
Holds the maximum permitted offset correction value to be applied by the internal clock synchronization
algorithm (absolute value). The CC checks only the internal offset correction value
against the maximum offset correction value. Valid values are 5 to 15266 uT.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MRC</name>
              <description>Maximum Rate Correction (pRateCorrectionOut)
Holds the maximum permitted rate correction value to be applied by the internal clock synchronization
algorithm. The CC checks only the internal rate correction value against the maximum
rate correction value (absolute value). Valid values are 2 to 1923 uT.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTUC11</name>
          <description>GTU Configuration Register 11</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7070303</resetMask>
          <fields>
            <field>
              <name>EOCC</name>
              <description>External Offset Correction Control (vExternOffsetControl)
By writing to EOCC[1:0] the external offset correction is enabled as specified below. Should be
modified only outside NIT.
00, 01 = No external offset correction
10 = External offset correction value subtracted from calculated offset correction value
11 = External offset correction value added to calculated offset correction value</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXT_OFFSET_CORRECTION</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EXT_OFFSET_CORRECTION_MIRROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_OFFSET_CORRECTION_SUBTRACTED</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_OFFSET_CORRECTION_ADDED</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERCC</name>
              <description>External Rate Correction Control (vExternRateControl)
By writing to ERCC[1:0] the external rate correction is enabled as specified below. Should be
modified only outside NIT.
00, 01 = No external rate correction
10 = External rate correction value subtracted from calculated rate correction value
11 = External rate correction value added to calculated rate correction value</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXT_RATE_CORRECTION</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EXT_RATE_CORRECTION_MIRROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_RATE_CORRECTION_SUBTRACTED</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_RATE_CORRECTION_ADDED</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOC</name>
              <description>External Offset Correction (pExternOffsetCorrection)
Holds the external offset correction value in microticks to be applied by the internal clock synchronization
algorithm. The value is subtracted / added from / to the calculated offset correction
value. The value is applied during NIT. May be modified in DEFAULT_CONFIG or CONFIG
state only. Valid values are 0 to 7 uT.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERC</name>
              <description>External Rate Correction (pExternRateCorrection)
Holds the external rate correction value in microticks to be applied by the internal clock synchronization
algorithm. The value is subtracted / added from / to the calculated rate correction
value. The value is applied during NIT. May be modified in DEFAULT_CONFIG or CONFIG
state only. Valid values are 0 to 7 uT.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSV</name>
          <description>CC Status Vector</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x104000</resetValue>
          <resetMask>0x3FFF73FF</resetMask>
          <fields>
            <field>
              <name>POCS</name>
              <description>N/A</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT_CONFIG</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_ACTIVE</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_PASSIVE</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONITOR_MODE</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG</name>
                  <description>N/A</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_STANDBY</name>
                  <description>N/A</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_LISTEN</name>
                  <description>N/A</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_SEND</name>
                  <description>N/A</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_DETECT</name>
                  <description>N/A</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STARTUP_PREPARE</name>
                  <description>N/A</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLDSTART_LISTEN</name>
                  <description>N/A</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLDSTART_COLLISION_RESOLUTION</name>
                  <description>N/A</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLDSTART_CONSISTENCY_CHECK</name>
                  <description>N/A</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLDSTART_GAP</name>
                  <description>N/A</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLDSTART_JOIN</name>
                  <description>N/A</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRATION_COLDSTART_CHECK</name>
                  <description>N/A</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRATION_LISTEN</name>
                  <description>N/A</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRATION_CONSISTENCY_CHECK</name>
                  <description>N/A</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIALIZE_SCHEDULE</name>
                  <description>N/A</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT_STARTUP</name>
                  <description>N/A</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STARTUP_SUCCESS</name>
                  <description>N/A</description>
                  <value>43</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSI</name>
              <description>Freeze Status Indicator (vPOC!Freeze)
Indicates that the POC has entered the HALT state due to CHI command FREEZE or due to an
error condition requiring an immediate POC halt. Reset by transition from HALT to
DEFAULT_CONFIG state.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HRQ</name>
              <description>Halt Request (vPOC!CHIHaltRequest)
Indicates that a request from the Host has been received to halt the POC at the end of the communication
cycle. Reset by transition from HALT to DEFAULT_CONFIG state or when entering
READY state.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLM</name>
              <description>N/A</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_PENDING</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSNI</name>
              <description>Coldstart Noise Indicator (vPOC!ColdstartNoise)
Indicates that the cold start procedure occurred under noisy conditions. Reset by CHI command
RESET_STATUS_INDICATORS or by transition from HALT to DEFAULT_CONFIG state or
from READY to STARTUP state.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSAI</name>
              <description>Coldstart Abort Indicator
Coldstart aborted. Reset by CHI command RESET_STATUS_INDICATORS or by transition
from HALT to DEFAULT_CONFIG state or from READY to STARTUP state.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI</name>
              <description>Cold Start Inhibit (vColdStartInhibit)
Indicates that the node is disabled from cold starting. The flag is set whenever the POC enters
READY state due to CHI command READY. The flag has to be reset under control of the Host
by CHI command ALLOW_COLDSTART (SUCC1.CMD[3:0] = '1001').
1 = Cold starting of node disabled
0 = Cold starting of node enabled</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODE_COLD_START_ENABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NODE_COLD_START_DISABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSV</name>
              <description>N/A</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNDEFINED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVED_HEADER</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVED_WUP</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLLISION_HEADER</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLLISION_WUP</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLLISION_UNKNOWN</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSMITTED</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCA</name>
              <description>Remaining Coldstart Attempts (vRemainingColdstartAttempts)
Indicates the number of remaining coldstart attempts. The RUN command resets this counter to
the maximum number of coldstart attempts as configured by SUCC1.CSA[4:0]. The initial
value of RCA[4:0] during CONFIG and DEFAULT_CONFIG state is also SUCC1.CSA[4:0].</description>
              <bitRange>[23:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PSL</name>
              <description>POC Status Log
Status of POCS[5:0] immediately before entering HALT state. Set when entering HALT state.
Set to HALT when FREEZE command is applied during HALT state and FSI is not already set
i.e. the HALT state was not reached by FREEZE command. Reset to '00 0000' when leaving
HALT state.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCEV</name>
          <description>CC Error Vector</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FCF</resetMask>
          <fields>
            <field>
              <name>CCFC</name>
              <description>Clock Correction Failed Counter (vClockCorrectionFailed)
The Clock Correction Failed Counter is incremented by one at the end of any odd communication
cycle where either the missing offset correction error or missing rate correction error are
active. The Clock Correction Failed Counter is reset to '0' at the end of an odd communication
cycle if neither the offset correction failed nor the rate correction failed errors are active. The
Clock Correction Failed Counter stops at 15.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRM</name>
              <description>N/A</description>
              <bitRange>[7:6]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASSIVE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMM_HALT</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTAC</name>
              <description>Passive to Active Count (vAllowPassiveToActive)
Indicates the number of consecutive even / odd cycle pairs that have passed with valid rate and
offset correction terms, while the node is waiting to transit from NORMAL_PASSIVE state to
NORMAL_ACTIVE state. The transition takes place when PTAC[4:0] equals
SUCC1.PTA[4:0] -1.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
