RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>SCV</name>
          <description>Slot Counter Value</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF07FF</resetMask>
          <fields>
            <field>
              <name>SCCA</name>
              <description>Slot Counter Channel A (vSlotCounter[A])
Current slot counter value on channel A. The value is incremented by the CC and reset at the
start of a communication cycle. Valid values are 0 to 2047.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SCCB</name>
              <description>Slot Counter Channel B (vSlotCounter[B])
Current slot counter value on channel B. The value is incremented by the CC and reset at the
start of a communication cycle. Valid values are 0 to 2047.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCCV</name>
          <description>Macrotick and Cycle Counter Value</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3FFF</resetMask>
          <fields>
            <field>
              <name>MTV</name>
              <description>Macrotick Value (vMacrotick)
Current macrotick value. The value is incremented by the CC and reset at the start of a communication
cycle. Valid values are 0 to 15999.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CCV</name>
              <description>Cycle Counter Value (vCycleCounter)
Current cycle counter value. The value is incremented by the CC at the start of a communication
cycle. Valid values are 0 to 63.</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCV</name>
          <description>Rate Correction Value</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>RCV</name>
              <description>Rate Correction Value (vRateCorrection)
Rate correction value (two's complement). Calculated internal rate correction value before limitation.
If the RCV value exceeds the limits defined by GTUC10.MRC[10:0], flag SFS.RCLR
is set to '1'.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCV</name>
          <description>Offset Correction Value</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>OCV</name>
              <description>Offset Correction Value (vOffsetCorrection)
Offset correction value (two's complement). Calculated internal offset correction value before
limitation. If the OCV value exceeds the limits defined by GTUC10.MOC[13:0], flag
SFS.OCLR is set to '1'.</description>
              <bitRange>[18:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFS</name>
          <description>Sync Frame Status</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>VSAE</name>
              <description>Valid Sync Frames Channel A, even communication cycle
Holds the number of valid sync frames received on channel A in the even communication cycle.
If transmission of sync frames is enabled by SUCC1.TXSY the value is incremented by one.
The value is updated during the NIT of each even communication cycle.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VSAO</name>
              <description>Valid Sync Frames Channel A, odd communication cycle
Holds the number of valid sync frames received on channel A in the odd communication cycle.
If transmission of sync frames is enabled by SUCC1.TXSY the value is incremented by one.
The value is updated during the NIT of each odd communication cycle.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VSBE</name>
              <description>Valid Sync Frames Channel B, even communication cycle
Holds the number of valid sync frames received on channel B in the even communication cycle.
If transmission of sync frames is enabled by SUCC1.TXSY the value is incremented by one.
The value is updated during the NIT of each even communication cycle.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VSBO</name>
              <description>Valid Sync Frames Channel B, odd communication cycle
Holds the number of valid sync frames received on channel B in the odd communication cycle.
If transmission of sync frames is enabled by SUCC1.TXSY the value is incremented by one.
The value is updated during the NIT of each odd communication cycle.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MOCS</name>
              <description>Missing Offset Correction Signal
The Missing Offset Correction flag signals to the Host, that no offset correction calculation can
be performed because no sync frames were received. The flag is updated by the CC at start of
offset correction phase.
1 = Missing offset correction signal
0 = Offset correction signal valid</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET_CORRECTION_SIGNAL_VALID</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET_CORRECTION_SIGNAL_INVALID</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCLR</name>
              <description>Offset Correction Limit Reached
The Offset Correction Limit Reached flag signals to the Host, that the offset correction value
has exceeded its limit as defined by GTUC10.MOC[13:0]. The flag is updated by the CC at
start of offset correction phase.
1 = Offset correction limit reached
0 = Offset correction below limit</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET_CORRECTION_BELOW_LIMIT</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET_CORRECTION_LIMIT_REACHED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRCS</name>
              <description>Missing Rate Correction Signal
The Missing Rate Correction flag signals to the Host, that no rate correction calculation can be
performed because no pairs of even / odd sync frames were received. The flag is updated by the
CC at start of offset correction phase.
1 = Missing rate correction signal
0 = Rate correction signal valid</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATE_CORRECTION_SIGNAL_VALID</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATE_CORRECTION_SIGNAL_INVALID</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCLR</name>
              <description>Rate Correction Limit Reached
The Rate Correction Limit Reached flag signals to the Host, that the rate correction value has
exceeded its limit as defined by GTUC10.MRC[10:0]. The flag is updated by the CC at start of
offset correction phase.
1 = Rate correction limit reached
0 = Rate correction below limit</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATE_CORRECTION_BELOW_LIMIT</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATE_CORRECTION_LIMIT_REACHED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWNIT</name>
          <description>Symbol Window and NIT Status</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>SESA</name>
              <description>Syntax Error in Symbol Window Channel A (vSS!SyntaxErrorA)
1 = Syntax error during symbol window detected on channel A
0 = No syntax error detected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNTAX_ERROR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNTAX_ERR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBSA</name>
              <description>Slot Boundary Violation in Symbol Window Channel A (vSS!BViolationA)
1 = Slot boundary violation during symbol window detected on channel A
0 = No slot boundary violation detected</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BNDRY_VIOLATION_ERROR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BNDRY_VIOLATION_ERROR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCSA</name>
              <description>Transmission Conflict in Symbol Window Channel A (vSS!TxConflictA)
1 = Transmission conflict in symbol window detected on channel A
0 = No transmission conflict detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TXMN_CONFLICT_IN_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXMN_CONFLICT_IN_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESB</name>
              <description>Syntax Error in Symbol Window Channel B (vSS!SyntaxErrorB)
1 = Syntax error during symbol window detected on channel B
0 = No syntax error detected</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNTAX_ERROR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNTAX_ERR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBSB</name>
              <description>Slot Boundary Violation in Symbol Window Channel B (vSS!BViolationB)
1 = Slot boundary violation during symbol window detected on channel B
0 = No slot boundary violation detected</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BNDRY_VIOLATION_ERROR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BNDRY_VIOLATION_ERROR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCSB</name>
              <description>Transmission Conflict in Symbol Window Channel B (vSS!TxConflictB)
1 = Transmission conflict in symbol window detected on channel B
0 = No transmission conflict detected</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TXMN_CONFLICT_IN_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXMN_CONFLICT_IN_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTSA__</name>
              <description>MTS Received on Channel A (vSS!ValidMTSA)
Media Access Test symbol received on channel A during the preceding symbol window.
Updated by the CC for each channel at the end of the symbol window. When this bit is set to '1',
also interrupt flag SIR.MTSA is set to '1'.
1 = MTS symbol received on channel A
0 = No MTS symbol received on channel A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MTS_SYMBOL_RXD_IN_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTS_SYMBOL_RXD_IN_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTSB__</name>
              <description>MTS Received on Channel B (vSS!ValidMTSB)
Media Access Test symbol received on channel B during the preceding symbol window.
Updated by the CC for each channel at the end of the symbol window. When this bit is set to '1',
also interrupt flag SIR.MTSB is set to '1'.
1 = MTS symbol received on channel B
0 = No MTS symbol received on channel B
NIT related status information. Updated by the CC at the end of the NIT for each channel:</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MTS_SYMBOL_RXD_IN_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTS_SYMBOL_RXD_IN_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENA</name>
              <description>Syntax Error during NIT Channel A (vSS!SyntaxErrorA)
1 = Syntax error during NIT detected on channel A
0 = No syntax error detected</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNTAX_ERROR_DETECTED_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNTAX_ERROR_DETECTED_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBNA</name>
              <description>Slot Boundary Violation during NIT Channel A (vSS!BViolationA)
1 = Slot boundary violation during NIT detected on channel A
0 = No slot boundary violation detected</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BNDRY_VIOLATION_ERROR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BNDRY_VIOLATION_ERROR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENB</name>
              <description>Syntax Error during NIT Channel B (vSS!SyntaxErrorB)
1 = Syntax error during NIT detected on channel B
0 = No syntax error detected</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNTAX_ERROR_DETECTED_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNTAX_ERROR_DETECTED_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBNB</name>
              <description>Slot Boundary Violation during NIT Channel B (vSS!BViolationB)
1 = Slot boundary violation during NIT detected on channel B
0 = No slot boundary violation detected</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BNDRY_VIOLATION_ERROR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BNDRY_VIOLATION_ERROR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
