RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>ACS</name>
          <description>Aggregated Channel Status</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F1F</resetMask>
          <fields>
            <field>
              <name>VFRA_</name>
              <description>Valid Frame Received on Channel A (vSS!ValidFrameA)
One or more valid frames were received on channel A in any static or dynamic slot during the
observation period.
1 = Valid frame(s) received on channel A
0 = No valid frame received</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_VALID_FRAME_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_FRAME_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEDA</name>
              <description>Syntax Error Detected on Channel A (vSS!SyntaxErrorA)
One or more syntax errors in static or dynamic slots, symbol window, and NIT were observed
on channel A.
1 = Syntax error(s) observed on channel A
0 = No syntax error observed</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNTAX_ERR_OBSVD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNTAX_ERR_OBSVD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEDA</name>
              <description>Content Error Detected on Channel A (vSS!ContentErrorA)
One or more frames with a content error were received on channel A in any static or dynamic
slot during the observation period.
1 = Frame(s) with content error received on channel A
0 = No frame with content error received</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FRAME_WITH_CONTENT_ERR_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_WITH_CONTENT_ERR_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIA</name>
              <description>Communication Indicator Channel A
One or more valid frames were received on channel A in slots that also contained any additional
communication during the observation period, i.e. one or more slots received a valid frame
AND had any combination of either syntax error OR content error OR slot boundary violation.
1 = Valid frame(s) received on channel A in slots containing any additional communication
0 = No valid frame(s) received in slots containing any additional communication</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_VALID_FRAME_RXD_ON_CH_A_IN_SLOTS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_FRAME_RXD_ON_CH_A_IN_SLOTS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBVA</name>
              <description>Slot Boundary Violation on Channel A (vSS!BViolationA)
One or more slot boundary violations were observed on channel A at any time during the observation
period (static or dynamic slots, symbol window, and NIT).
1 = Slot boundary violation(s) observed on channel A
0 = No slot boundary violation observed</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BNDRY_VIOLATION_ERROR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BNDRY_VIOLATION_ERROR_IN_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VFRB_</name>
              <description>Valid Frame Received on Channel B (vSS!ValidFrameB)
One or more valid frames were received on channel B in any static or dynamic slot during the
observation period. Reset under control of the Host.
1 = Valid frame(s) received on channel B
0 = No valid frame received</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_VALID_FRAME_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_FRAME_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEDB</name>
              <description>Syntax Error Detected on Channel B (vSS!SyntaxErrorB)
One or more syntax errors in static or dynamic slots, symbol window, and NIT were observed
on channel B.
1 = Syntax error(s) observed on channel B
0 = No syntax error observed</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNTAX_ERR_OBSVD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNTAX_ERR_OBSVD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEDB</name>
              <description>Content Error Detected on Channel B (vSS!ContentErrorB)
One or more frames with a content error were received on channel B in any static or dynamic
slot during the observation period.
1 = Frame(s) with content error received on channel B
0 = No frame with content error received</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FRAME_WITH_CONTENT_ERR_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_WITH_CONTENT_ERR_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIB</name>
              <description>Communication Indicator Channel B
One or more valid frames were received on channel B in slots that also contained any additional
communication during the observation period, i.e. one or more slots received a valid frame
AND had any combination of either syntax error OR content error OR slot boundary violation.
1 = Valid frame(s) received on channel B in slots containing any additional communication
0 = No valid frame(s) received in slots containing any additional communication</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_VALID_FRAME_RXD_ON_CH_B_IN_SLOTS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_FRAME_RXD_ON_CH_B_IN_SLOTS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBVB</name>
              <description>Slot Boundary Violation on Channel B (vSS!BViolationB)
One or more slot boundary violations were observed on channel B at any time during the observation
period (static or dynamic slots, symbol window, and NIT).
1 = Slot boundary violation(s) observed on channel B
0 = No slot boundary violation observed</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BNDRY_VIOLATION_ERROR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BNDRY_VIOLATION_ERROR_IN_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>15</dim>
          <dimIncrement>4</dimIncrement>
          <name>ESID[%s]</name>
          <description>Even Sync ID [1...15]</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC3FF</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>Even Sync ID (vsSyncIDListA,B even)
Sync frame ID even communication cycle.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXEA</name>
              <description>Received / Configured Even Sync ID on Channel A
Signals that a sync frame corresponding to the stored even sync ID was received on channel A or
that the node is configured to be a sync node with key slot = EID[9:0] (ESID1 only).
1 = Sync frame received on channel A / node configured to transmit sync frames
0 = No sync frame received on channel A / node not configured to transmit sync frames</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNC_FRAME_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAME_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXEB</name>
              <description>Received / Configured Even Sync ID on Channel B
Signals that a sync frame corresponding to the stored even sync ID was received on channel B or
that the node is configured to be a sync node with key slot = EID[9:0] (ESID1 only).
1 = Sync frame received on channel B / node configured to transmit sync frames
0 = No sync frame received on channel B / node not configured to transmit sync frames</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNC_FRAME_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAME_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>15</dim>
          <dimIncrement>4</dimIncrement>
          <name>OSID[%s]</name>
          <description>Odd Sync ID [1...15]</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC3FF</resetMask>
          <fields>
            <field>
              <name>OID</name>
              <description>Odd Sync ID (vsSyncIDListA,B odd)
Sync frame ID odd communication cycle.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOA</name>
              <description>Received / Configured Odd Sync ID on Channel A
Signals that a sync frame corresponding to the stored odd sync ID was received on channel A or
that the node is configured to be a sync node with key slot = OID[9:0] (OSID1 only).
1 = Sync frame received on channel A / node configured to transmit sync frames
0 = No sync frame received on channel A / node not configured to transmit sync frames</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNC_FRAME_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAME_RXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXOB</name>
              <description>Received / Configured Odd Sync ID on Channel B
Signals that a sync frame corresponding to the stored odd sync ID was received on channel B or
that the node is configured to be a sync node with key slot = OID[9:0] (OSID1 only).
1 = Sync frame received on channel B / node configured to transmit sync frames
0 = No sync frame received on channel B / node not configured to transmit sync frames</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNC_FRAME_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAME_RXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NMV1</name>
          <description>Network Management Vector 1</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Data0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Data1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>Data2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA3</name>
              <description>Data3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NMV2</name>
          <description>Network Management Vector 2</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA4</name>
              <description>Data4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA5</name>
              <description>Data5</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA6</name>
              <description>Data6</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA7</name>
              <description>Data7</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NMV3</name>
          <description>Network Management Vector 3</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>Data8</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA9</name>
              <description>Data9</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA10</name>
              <description>Data10</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA11</name>
              <description>Data11</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
