RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>MRC</name>
          <description>Message RAM Configuration</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1800000</resetValue>
          <resetMask>0x7FFFFFF</resetMask>
          <fields>
            <field>
              <name>FDB</name>
              <description>N/A</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FFB</name>
              <description>First Buffer of FIFO
0 = All message buffers assigned to the FIFO
1...127 = Message buffers from FFB to LCB assigned to the FIFO
128 = No message buffer assigned to the FIFO</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCB</name>
              <description>Last Configured Buffer
0...127 = Number of message buffers is LCB + 1
128 = No message buffer configured</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure Buffers
Not evaluated when the CC is in DEFAULT_CONFIG or CONFIG state. For temporary unlocking
see 5.12.4 Host Handling of Parity Errors.
00 = Reconfiguration of message buffers enabled with numbers &lt; FFB enabled
Exception: In nodes configured for sync frame transmission or for single slot mode operation
message buffer 0 (and if SPLM = '1', also message buffer 1) is always locked
01 = Reconfiguration of message buffers with numbers &lt; FDB and with numbers &gt;= FFB locked
and transmission of message buffers for static segment with numbers &gt;= FDB disabled
10 = Reconfiguration of all message buffers locked
11 = Reconfiguration of all message buffers locked
and transmission of message buffers for static segment with numbers =&gt; FDB disabled</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSG_BUFFERS_LT_FFB_ENABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_BUFFERS_LT_FDB_ENABLED_AND_GT_FFB_LOCKED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_MSG_BUFFERS_LOCKED</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_MSG_BUFFERS_LOCKED_AND_TXMN_OF_GT_FDB_LOCKED</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLM</name>
              <description>Sync Frame Payload Multiplex
This bit is only evaluated if the node is configured as sync node (SUCC1.TXSY = '1') or for
single slot mode operation (SUCC1.TSM = '1'). When this bit is set to '1' message buffers 0
and 1 are dedicated for sync frame transmission with different payload data on channel A and B.
When this bit is set to '0', sync frames are transmitted from message buffer 0 with the same payload
data on both channels. Note that the channel filter configuration for message buffer 0 resp.
message buffer 1 has to be chosen accordingly.
1 = Both message buffers 0 and 1 are locked against reconfiguration
0 = Only message buffer 0 locked against reconfiguration</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSG_BUFFER_0_LOCKED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_BUFFER_0_AND_1_LOCKED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRF</name>
          <description>FIFO Rejection Filter</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1800000</resetValue>
          <resetMask>0x1FF1FFF</resetMask>
          <fields>
            <field>
              <name>CH</name>
              <description>Channel Filter
11 = no reception
10 = receive only on channel A
01 = receive only on channel B
00 = receive on both channels</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECEIVE_ON_BOTH_CHANNELS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVE_ONLY_ON_CHANNEL_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVE_ONLY_ON_CHANNEL_A</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_RECEPTION</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FID_</name>
              <description>Frame ID Filter
Determines the frame ID to be rejected by the FIFO. With the additional configuration of register
FRFM, the corresponding frame ID filter bits are ignored, which results in further rejected
frame IDs. When FRFM.MFID[10:0] is zero, a frame ID filter value of zero means that no
frame ID is rejected.
0...2047 = Frame ID filter values</description>
              <bitRange>[12:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYF</name>
              <description>Cycle Counter Filter
The 7-bit cycle counter filter determines the cycle set to which frame ID and channel rejection
filter are applied. In cycles not belonging to the cycle set specified by CYF[6:0], all frames are
rejected. For details about the configuration of the cycle counter filter see [01]Section 5.7.2 Cycle
Counter Filtering.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSS</name>
              <description>Reject in Static Segment
If this bit is set, the FIFO is used only for the dynamic segment.
1 = Reject messages in static segment
0 = FIFO also used for static segment</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_STATIC_SEGMENT_STORAGE_ENABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_STATIC_SEGMENT_STORAGE_DISABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNF</name>
              <description>Reject Null Frames
If this bit is set, received null frames are not stored in the FIFO.
1 = Reject all null frames
0 = Null frames are stored in the FIFO</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NULL_FRAMES_FIFO_STORAGE_ENABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NULL_FRAMES_FIFO_STORAGE_DISABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRFM</name>
          <description>FIFO Rejection Filter Mask</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFC</resetMask>
          <fields>
            <field>
              <name>MFID</name>
              <description>Mask Frame ID Filter
1 = Ignore corresponding frame ID filter bit.
0 = Corresponding frame ID filter bit is used for rejection filtering</description>
              <bitRange>[12:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCL</name>
          <description>FIFO Critical Level</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CL</name>
              <description>Critical Level
When the receive FIFO fill level FSR.RFFL[7:0] is equal or greater than the critical level configured
by CL[7:0], the receive FIFO critical level flag FSR.RFCL is set. If CL[7:0] is programmed
to values &gt; 128, bit FSR.RFCL is never set. When FSR.RFCL changes from '0' to
1' bit SIR.RFCL is set to '1', and if enabled, an interrupt is generated.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MHDS</name>
          <description>Message Handler Status</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x7F7F7FFF</resetMask>
          <fields>
            <field>
              <name>PIBF</name>
              <description>Parity Error Input Buffer RAM 1,2
1 = Parity error occurred when reading Input Buffer RAM 1,2
0 = No parity error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PARITY_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARITY_ERROR_IN_IBF_RAM_1_2</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POBF</name>
              <description>Parity Error Output Buffer RAM 1,2
1 = Parity error occurred when reading Output Buffer RAM 1,2
0 = No parity error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PARITY_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARITY_ERROR_IN_OBF_RAM_1_2</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMR</name>
              <description>Parity Error Message RAM
1 = Parity error occurred when reading the Message RAM
0 = No parity error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PARITY_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARITY_ERROR_IN_MSG_RAM</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTBF1</name>
              <description>Parity Error Transient Buffer RAM A
1 = Parity error occurred when reading Transient Buffer RAM A
0 = No parity error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PARITY_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARITY_ERROR_IN_TRAN_BUF_RAM_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTBF2</name>
              <description>Parity Error Transient Buffer RAM B
1 = Parity error occurred when reading Transient Buffer RAM B
0 = No parity error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PARITY_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARITY_ERROR_IN_TRAN_BUF_RAM_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMBD</name>
              <description>Faulty Message Buffer Detected
1 = Message buffer referenced by FMB[6:0] holds faulty data due to a parity error
0 = No faulty message buffer</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FAULTY_MSG_BUFFER</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULTY_MSG_BUFFER_ERROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFMB</name>
              <description>Multiple Faulty Message Buffers detected
1 = Another faulty message buffer was detected while flag FMBD is set
0 = No additional faulty message buffer</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ADDITIONAL_FAULTY_MSG_BUFFER</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDITIONAL_FAULTY_MSG_BUFFER_ERROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRAM</name>
              <description>Clear all internal RAM's
Signals that execution of the CHI command CLEAR_RAMS is ongoing (all bits of all internal
RAM blocks are written to '0'). The bit is set by hard reset or by CHI command
CLEAR_RAMS.
1 = Execution of the CHI command CLEAR_RAMS ongoing
0 = No execution of the CHI command CLEAR_RAMS</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RAMS_NOT_IN_PROGRESS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_RAMS_IN_PROGRESS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMB</name>
              <description>Faulty Message Buffer
Parity error occurred when reading from the message buffer or when transferring data from
Input Buffer or Transient Buffer 1,2 to the message buffer referenced by FMB[6:0]. Value only
valid when one of the flags PIBF, PMR, PTBF1, PTBF2, and flag FMBD is set. Is not updated
while flag FMBD is set.</description>
              <bitRange>[14:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MBT</name>
              <description>Message Buffer Transmitted
Number of last successfully transmitted message buffer. If the message buffer is configured for
single-shot mode, the respective TXR flag in the TXRQ1/2/3/4 registers was reset.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MBU</name>
              <description>Message Buffer Updated
Number of message buffer that was updated last by the CC. For this message buffer the
respective ND and / or MBC flag in the NDAT1/2/3/4 registers and the MBSC1/2/3/4 registers
are also set.</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDTS</name>
          <description>Last Dynamic Transmit Slot</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF07FF</resetMask>
          <fields>
            <field>
              <name>LDTA</name>
              <description>Last Dynamic Transmission Channel A
Value of vSlotCounter[A] at the time of the last frame transmission on channel A in the dynamic
segment of this node. It is updated at the end of the dynamic segment and is reset to zero if no
frame was transmitted during the dynamic segment.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LDTB</name>
              <description>Last Dynamic Transmission Channel B
Value of vSlotCounter[B] at the time of the last frame transmission on channel B in the dynamic
segment of this node. It is updated at the end of the dynamic segment and is reset to zero if no
frame was transmitted during the dynamic segment.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSR</name>
          <description>FIFO Status Register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF07</resetMask>
          <fields>
            <field>
              <name>RFNE_</name>
              <description>Receive FIFO Not Empty
This flag is set by the CC when a received valid frame (data or null frame depending on rejection
mask) was stored in the FIFO. In addition, interrupt flag SIR.RFNE is set. The bit is reset after
the Host has read all message from the FIFO.
1 = Receive FIFO is not empty
0 = Receive FIFO is empty</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FIFO_EMPTY</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FIFO_NOT_EMPTY</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFCL_</name>
              <description>Receive FIFO Critical Level
This flag is set when the receive FIFO fill level RFFL[7:0] is equal or greater than the critical
level as configured by FCL.CL[7:0]. The flag is cleared by the CC as soon as RFFL[7:0] drops
below FCL.CL[7:0]. When RFCL changes from '0' to '1' bit SIR.RFCL is set to '1', and if
enabled, an interrupt is generated.
1 = Receive FIFO critical level reached
0 = Receive FIFO below critical level</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FIFO_LT_CRITICAL_LEVEL</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FIFO_CRITICAL_LEVEL</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFO_</name>
              <description>Receive FIFO Overrun
The flag is set by the CC when a receive FIFO overrun is detected. When a receive FIFO overrun
occurs, the oldest message is overwritten with the actual received message. In addition, interrupt
flag EIR.RFO is set.The flag is cleared by the next FIFO read access issued by the Host.
1 = A receive FIFO overrun has been detected
0 = No receive FIFO overrun detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FIFO_NO_OVERRUN</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FIFO_OVERRUN</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFFL</name>
              <description>Receive FIFO Fill Level
Number of FIFO buffers filled with new data not yet read by the Host. Maximum value is 128.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
