RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>MHDF</name>
          <description>Message Handler Constraints Flags</description>
          <addressOffset>0x31C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>SNUA</name>
              <description>Status Not Updated Channel A
This flag is set by the CC when the Message Handler, due to overload condition, was not able to
update a message buffer's status MBS with respect to channel A.
1 = MBS for channel A not updated
0 = No overload condition occurred when updating MBS for channel A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MBS_FOR_CH_A_UPDATED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBS_FOR_CH_A_NOT_UPDATED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNUB</name>
              <description>Status Not Updated Channel B
This flag is set by the CC when the Message Handler, due to overload condition, was not able to
update a message buffer's status MBS with respect to channel B.
1 = MBS for channel B not updated
0 = No overload condition occurred when updating MBS for channel B</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MBS_FOR_CH_B_UPDATED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBS_FOR_CH_B_NOT_UPDATED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FNFA</name>
              <description>Find Sequence Not Finished Channel A
This flag is set by the CC when the Message Handler, due to overload condition, was not able to
finish a find sequence (scan of Message RAM for matching message buffer) with respect to
channel A.
1 = Find sequence not finished for channel A
0 = No find sequence not finished for channel A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_A_FIND_SEQ_NOT_FINISHED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_FIND_SEQ_NOT_FINISHED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FNFB</name>
              <description>Find Sequence Not Finished Channel B
This flag is set by the CC when the Message Handler, due to overload condition, was not able to
finish a find sequence (scan of Message RAM for matching message buffer) with respect to
channel B.
1 = Find sequence not finished for channel B
0 = No find sequence not finished for channel B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_B_FIND_SEQ_NOT_FINISHED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_FIND_SEQ_NOT_FINISHED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBFA</name>
              <description>Transient Buffer Access Failure A
This flag is set by the CC when a read or write access to TBF A requested by PRT A could not
complete within the available time.
1 = TBF A access failure
0 = No TBF A access failure</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBF_CH_A_ACCESS_NOT_FAILED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBF_CH_A_ACCESS_FAILED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBFB</name>
              <description>Transient Buffer Access Failure B
This flag is set by the CC when a read or write access to TBF B requested by PRT B could not
complete within the available time.
1 = TBF B access failure
0 = No TBF B access failure</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBF_CH_B_ACCESS_NOT_FAILED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBF_CH_B_ACCESS_FAILED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNSA</name>
              <description>Transmission Not Started Channel A
This flag is set by the CC when the Message Handler was not ready to start a scheduled transmission
on channel A at the action point of the configured slot.
1 = Transmission not started on channel A
0 = No transmission not started on channel A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_A_TXMN_NOT_STARTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_TXMN_NOT_STARTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNSB</name>
              <description>Transmission Not Started Channel B
This flag is set by the CC when the Message Handler was not ready to start a scheduled transmission
on channel B at the action point of the configured slot.
1 = Transmission not started on channel B
0 = No transmission not started on channel B</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CH_B_TXMN_NOT_STARTED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_TXMN_NOT_STARTED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAHP</name>
              <description>Write Attempt to Header Partition
Outside DEFAULT_CONFIG and CONFIG state this flag is set by the CC when the message
handler tries to write message data into the header partition of the Message RAM due to faulty
configuration of a message buffer. The write attempt is not executed, to protect the header partition
from unintended write accesses.
1 = Write attempt to header partition
0 = No write attempt to header partition</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HEADER_PARTITION_NO_WRITE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_PARTITION_WRITE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ1</name>
          <description>Transmission Request 1</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXR</name>
              <description>Transmission Request
 TRX[31:0]
If the flag is set, the respective message buffer is ready for transmission respectively transmission
of this message buffer is in progress. In single-shot mode the flags are reset after transmission
has completed.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ2</name>
          <description>Transmission Request 2</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXR</name>
              <description>Transmission Request 
TRX[63:32]
If the flag is set, the respective message buffer is ready for transmission respectively transmission
of this message buffer is in progress. In single-shot mode the flags are reset after transmission
has completed.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ3</name>
          <description>Transmission Request 3</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXR</name>
              <description>Transmission Request
 TRX[95:64]
If the flag is set, the respective message buffer is ready for transmission respectively transmission
of this message buffer is in progress. In single-shot mode the flags are reset after transmission
has completed.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ4</name>
          <description>Transmission Request 4</description>
          <addressOffset>0x32C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXR</name>
              <description>Transmission Request 
TRX[127:96]
If the flag is set, the respective message buffer is ready for transmission respectively transmission
of this message buffer is in progress. In single-shot mode the flags are reset after transmission
has completed.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NDAT1</name>
          <description>New Data 1</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ND</name>
              <description>New Data
 ND[31:0]
The flags are set when a valid received data frame matches the message buffer's filter configuration,
independent of the payload length received or the payload length configured for that message
buffer. The flags are not set after reception of null frames except for message buffers
belonging to the receive FIFO. An ND flag is reset when the header section of the corresponding
message buffer is reconfigured or when the data section has been transferred to the Output
Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NDAT2</name>
          <description>New Data 2</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ND</name>
              <description>New Data
 ND[63:32]
The flags are set when a valid received data frame matches the message buffer's filter configuration,
independent of the payload length received or the payload length configured for that message
buffer. The flags are not set after reception of null frames except for message buffers
belonging to the receive FIFO. An ND flag is reset when the header section of the corresponding
message buffer is reconfigured or when the data section has been transferred to the Output
Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NDAT3</name>
          <description>New Data 3</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ND</name>
              <description>New Data
 ND[95:64]
The flags are set when a valid received data frame matches the message buffer's filter configuration,
independent of the payload length received or the payload length configured for that message
buffer. The flags are not set after reception of null frames except for message buffers
belonging to the receive FIFO. An ND flag is reset when the header section of the corresponding
message buffer is reconfigured or when the data section has been transferred to the Output
Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NDAT4</name>
          <description>New Data 4</description>
          <addressOffset>0x33C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ND</name>
              <description>New Data
 ND[127:96]
The flags are set when a valid received data frame matches the message buffer's filter configuration,
independent of the payload length received or the payload length configured for that message
buffer. The flags are not set after reception of null frames except for message buffers
belonging to the receive FIFO. An ND flag is reset when the header section of the corresponding
message buffer is reconfigured or when the data section has been transferred to the Output
Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBSC1</name>
          <description>Message Buffer Status Changed 1</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBC</name>
              <description>Message Buffer Status Changed
 MBC[31:0]
An MBC flag is set whenever the Message Handler changes one of the status flags VFRA,
VFRB, SEOA, SEOB, CEOA, CEOB, SVOA, SVOB, TCIA, TCIB, ESA, ESB, MLST,
FTA, FTB in the header section (see 4.11.5 Message Buffer Status (MBS) and 5.12.1 Header
Partition, header 4) of the respective message buffer. An MBC flag is reset when the header section
of the corresponding message buffer is reconfigured or when it has been transferred to the
Output Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBSC2</name>
          <description>Message Buffer Status Changed 2</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBC</name>
              <description>Message Buffer Status Changed
 MBC[63:32]
An MBC flag is set whenever the Message Handler changes one of the status flags VFRA,
VFRB, SEOA, SEOB, CEOA, CEOB, SVOA, SVOB, TCIA, TCIB, ESA, ESB, MLST,
FTA, FTB in the header section (see 4.11.5 Message Buffer Status (MBS) and 5.12.1 Header
Partition, header 4) of the respective message buffer. An MBC flag is reset when the header section
of the corresponding message buffer is reconfigured or when it has been transferred to the
Output Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBSC3</name>
          <description>Message Buffer Status Changed 3</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBC</name>
              <description>Message Buffer Status Changed
 MBC[95:64]
An MBC flag is set whenever the Message Handler changes one of the status flags VFRA,
VFRB, SEOA, SEOB, CEOA, CEOB, SVOA, SVOB, TCIA, TCIB, ESA, ESB, MLST,
FTA, FTB in the header section (see 4.11.5 Message Buffer Status (MBS) and 5.12.1 Header
Partition, header 4) of the respective message buffer. An MBC flag is reset when the header section
of the corresponding message buffer is reconfigured or when it has been transferred to the
Output Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBSC4</name>
          <description>Message Buffer Status Changed 4</description>
          <addressOffset>0x34C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBC</name>
              <description>Message Buffer Status Changed
 MBC[127:96]
An MBC flag is set whenever the Message Handler changes one of the status flags VFRA,
VFRB, SEOA, SEOB, CEOA, CEOB, SVOA, SVOB, TCIA, TCIB, ESA, ESB, MLST,
FTA, FTB in the header section (see 4.11.5 Message Buffer Status (MBS) and 5.12.1 Header
Partition, header 4) of the respective message buffer. An MBC flag is reset when the header section
of the corresponding message buffer is reconfigured or when it has been transferred to the
Output Buffer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CREL</name>
          <description>Core Release Register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10390206</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAY</name>
              <description>Design Time Stamp, Day
Two digits, BCD-coded.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MON</name>
              <description>Design Time Stamp, Month
Two digits, BCD-coded.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>YEAR</name>
              <description>Design Time Stamp, Year
One digit, BCD-coded.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STEP</name>
              <description>Step of Core Release
Two digits, BCD-coded.</description>
              <bitRange>[27:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REL</name>
              <description>Core Release
One digit, BCD-coded.
Table 5: Coding for releases</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDN</name>
          <description>Endian Register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x87654321</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ETV</name>
              <description>Endianness Test Value
The endianness test value is 0x87654321.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>4</dimIncrement>
          <name>WRDS[%s]</name>
          <description>Write Data Section [1...64]</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MD</name>
              <description>Message Data
MD[7:0] = DW2n-1, byte4n-4
MD[15:8] = DW2n-1, byte4n-3
MD[23:16] = DW2n, byte4n-2
MD[31:24] = DW2n, byte4n-1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
