RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>WRHS1</name>
          <description>Write Header Section 1</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F7F07FF</resetMask>
          <fields>
            <field>
              <name>FID</name>
              <description>Frame ID
Frame ID of the selected message buffer. The frame ID defines the slot number for transmission
reception of the respective message. Message buffers with frame ID = '0' are considered as
not valid.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYC</name>
              <description>Cycle Code
The 7-bit cycle code determines the cycle set used for cycle counter filtering. For details about
the configuration of the cycle code see [01]Section 5.7.2 Cycle Counter Filtering.
CHA, CHB Channel Filter Control
The 2-bit channel filtering field associated with each buffer serves as a filter for receive buffers,
and as a control field for transmit buffers.
CHA CHB.
Transmit Buffer
transmit frame on
Receive Buffer
store frame received from
1 1 both channels
static segment only)
channel A or B
store first semantically valid frame,
static segment only)
1 0 channel A channel A
0 1 channel B channel B
0 0 no transmission ignore frame</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHA</name>
              <description>Channel Filter Control A
The 2-bit channel filtering field associated with each buffer serves as a filter for receive buffers,
and as a control field for transmit buffers.
 









Note: If a message buffer is configured for the dynamic segment and both bits of the channel filtering
field are set to '1', no frames are transmitted resp. received frames are ignored (same function
as CHA = CHB = '0')</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHB</name>
              <description>Channel Filter Control B
The 2-bit channel filtering field associated with each buffer serves as a filter for receive buffers,
and as a control field for transmit buffers.
 









Note: If a message buffer is configured for the dynamic segment and both bits of the channel filtering
field are set to '1', no frames are transmitted resp. received frames are ignored (same function
as CHA = CHB = '0')</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Message Buffer Direction Configuration Bit
This bit is used to configure the corresponding buffer as transmit buffer or as receive buffer. For
message buffers belonging to the receive FIFO the bit is not evaluated.
1 = The corresponding buffer is configured as Transmit Buffer
0 = The corresponding buffer is configured as Receive Buffer</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_BUFF</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_BUFF</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPIT</name>
              <description>Payload Preamble Indicator Transmit
This bit is used to control the state of the Payload Preamble Indicator in transmit frames. If the
bit is set in a static message buffer, the respective message buffer holds network management
information. If the bit is set in a dynamic message buffer the first two bytes of the payload segment
may be used for message ID filtering by the receiver. Message ID filtering of received
FlexRay frames is not supported by the E-Ray module, but can be done by the Host.
1 = Payload Preamble Indicator set
0 = Payload Preamble Indicator not set</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAYLOAD_PREAMBLE_NOT_SET</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_PREAMBLE_SET</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXM</name>
              <description>Transmission Mode
This bit is used to select the transmission mode (see [01]Section 5.8.3 Transmit Buffers).
1 = Single-shot mode
0 = Continuous mode</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS_MODE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_SHOT_MODE</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBI</name>
              <description>Message Buffer Interrupt
This bit enables the receive / transmit interrupt for the corresponding message buffer. After a
dedicated receive buffer has been updated by the Message Handler, flag SIR.RXI and /or
SIR.MBSI are set. After a transmission has completed flag SIR.TXI is set.
1 = The corresponding message buffer interrupt is enabled
0 = The corresponding message buffer interrupt is disabled</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSG_BUFF_INTR_DISABLED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_BUFF_INTR_ENABLED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRHS2</name>
          <description>Write Header Section 2</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F07FF</resetMask>
          <fields>
            <field>
              <name>CRC</name>
              <description>Header CRC (vRF!Header!HeaderCRC)
Receive Buffer: Configuration not required
Transmit Buffer: Header CRC calculated and configured by the Host
For calculation of the header CRC the payload length of the frame send on the bus has to be considered.
In static segment the payload length of all frames is configured by MHDC.SFDL[6:0].</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLC</name>
              <description>Payload Length Configured
Length of data section (number of 2-byte words) as configured by the Host. During static segment
the static frame payload length as configured by MHDC.SFDL[6:0] defines the payload
length for all static frames. If the payload length configured by PLC[6:0] is shorter than this
value padding bytes are inserted to ensure that frames have proper physical length. The padding
pattern is logical zero (see also Section 5.8.3 Transmit Buffers).</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRHS3</name>
          <description>Write Header Section 3</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF</resetMask>
          <fields>
            <field>
              <name>DP</name>
              <description>Data Pointer
Pointer to the first 32-bit word of the data section of the addressed message buffer in the Message
RAM.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBCM</name>
          <description>Input Buffer Command Mask</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x70007</resetMask>
          <fields>
            <field>
              <name>LHSH</name>
              <description>Load Header Section Host
1 = Header section selected for transfer from Input Buffer to the Message RAM
0 = Header section is not updated</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HEADER_SECTION_NOT_UPDATED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_SECTION_UPDATED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDSH</name>
              <description>Load Data Section Host
1 = Data section selected for transfer from Input Buffer to the Message RAM
0 = Data section is not updated</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_SECTION_NOT_UPDATED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_SECTION_UPDATED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STXRH</name>
              <description>Set Transmission Request Host
If this bit is set to '1', the TXR flag for the selected message buffer is set in the TXRQ1/2/3/4
registers to release the message buffer for transmission. In single-shot mode the flag is cleared
by the CC after transmission has completed. TXR is evaluated for transmit buffers only.
1 = Set TXR flag, transmit buffer released for transmission
0 = Reset TXR flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXR_FLAG_RESET</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXR_FLAG_SET</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LHSS</name>
              <description>Load Header Section Shadow
1 = Header section selected for transfer from Input Buffer to the Message RAM
transfer ongoing or finished)
0 = Header section is not updated</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HEADER_SECTION_NOT_UPDATED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_SECTION_UPDATED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDSS</name>
              <description>Load Data Section Shadow
1 = Data section selected for transfer from Input Buffer to the Message RAM
transfer ongoing or finished)
0 = Data section is not updated</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_SECTION_NOT_UPDATED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_SECTION_UPDATED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STXRS</name>
              <description>Set Transmission Request Shadow
1 = Set TXR flag, transmit buffer released for transmission (operation ongoing or finished)
0 = Reset TXR flag</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXR_FLAG_RESET</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXR_FLAG_SET</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IBCR</name>
          <description>Input Buffer Command Request</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807F807F</resetMask>
          <fields>
            <field>
              <name>IBRH</name>
              <description>Input Buffer Request Host
Selects the target message buffer in the Message RAM for data transfer from Input Buffer.
Valid values are 0x00 to 0x7F (0...127).</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IBSYH</name>
              <description>Input Buffer Busy Host
Set to '1' by writing IBRH[6:0] while IBSYS is still '1'. After the ongoing transfer between
IBF Shadow and the Message RAM has completed, the IBSYH is set back to '0'.
1 = Request while transfer between IBF Shadow and Message RAM in progress
0 = No request pending</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQUEST_NOT_PENDING</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST_IN_PROGRESS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBRS</name>
              <description>Input Buffer Request Shadow
Number of the target message buffer actually updated / lately updated.
Valid values are 0x00 to 0x7F (0...127).</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IBSYS</name>
              <description>Input Buffer Busy Shadow
Set to '1' after writing IBRH[6:0]. When the transfer between IBF Shadow and the Message
RAM has completed, IBSYS is set back to '0'.
1 = Transfer between IBF Shadow and Message RAM in progress
0 = Transfer between IBF Shadow and Message RAM completed</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFR_IBF2MSRAM_COMPLETE</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFR_IBF2MSRAM_IN_PROGRESS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>4</dimIncrement>
          <name>RDDS[%s]</name>
          <description>Read Data Section [1...64]</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MD</name>
              <description>Message Data
MD[7:0] = DW2n-1, byte4n-4
MD[15:8] = DW2n-1, byte4n-3
MD[23:16] = DW2n, byte4n-2
MD[31:24] = DW2n, byte4n-1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHS1</name>
          <description>Read Header Section 1</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F7F07FF</resetMask>
          <fields>
            <field>
              <name>FID</name>
              <description>Frame ID</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CYC</name>
              <description>Cycle Code</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHA</name>
              <description>Channel Filter Control A</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHB</name>
              <description>Channel Filter Control B</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Message Buffer Direction Configuration Bit</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PPIT</name>
              <description>Payload Preamble Indicator Transmit</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXM</name>
              <description>Transmission Mode</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MBI</name>
              <description>Message Buffer Interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHS2</name>
          <description>Read Header Section 2</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F7F07FF</resetMask>
          <fields>
            <field>
              <name>CRC</name>
              <description>Header CRC (vRF!Header!HeaderCRC)
Receive Buffer: Header CRC updated from received data frames
Transmit Buffer: Header CRC calculated and configured by the Host</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLC</name>
              <description>Payload Length Configured
Length of data section (number of 2-byte words) as configured by the Host.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLR</name>
              <description>Payload Length Received (vRF!Header!Length)
Payload length value updated from received data frames (exception: if message buffer belongs
to the receive FIFO PLR[6:0] is also updated from received null frames)
When a message is stored into a message buffer the following behaviour with respect to payload
length received and payload length configured is implemented:
PLR[6:0] &gt; PLC[6:0]: The payload data stored in the message buffer is truncated to the payload
length configured if PLC[6:0] even or else truncated to PLC[6:0] + 1.
PLR[6:0] &lt;= PLC[6:0]: The received payload data is stored into the message buffers data section.
The remaining data bytes of the data section as configured by PLC[6:0]
are filled with undefined data
PLR[6:0] = zero: The message buffer's data section is filled with undefined data
PLC[6:0] = zero: Message buffer has no data section configured. No data is stored into the
message buffer's data section.</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
