RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
            </field>
            <field>
              <name>PPIS</name>
              <description>Payload Preamble Indicator Status (vRF!Header!PPIndicator)
The payload preamble indicator defines whether a network management vector or message ID is
contained within the payload segment of the received frame.
1 = Static segment: Network management vector at the beginning of the payload
Dynamic segment: Message ID at the beginning of the payload
0 = The payload segment of the received frame does not contain a network management vector
or a message ID</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_HAS_NO_NMV_MID</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_WITH_NMV_MID</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESS</name>
              <description>N/A</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OBCM</name>
          <description>Output Buffer Command Mask</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x30003</resetMask>
          <fields>
            <field>
              <name>RHSS</name>
              <description>Read Header Section Shadow
1 = Header section selected for transfer from Message RAM to Output Buffer
0 = Header section is not read</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HEADER_SECTION_NOT_READ</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_SECTION_FOR_MSRAM2OBF_TXFR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDSS</name>
              <description>Read Data Section Shadow
1 = Data section selected for transfer from Message RAM to Output Buffer
0 = Data section is not read</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_SECTION_NOT_READ</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_SECTION_FOR_MSRAM2OBF_TXFR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RHSH</name>
              <description>Read Header Section Host
1 = Header section selected for transfer from Message RAM to Output Buffer
0 = Header section is not read</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HEADER_SECTION_NOT_READ</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEADER_SECTION_FOR_MSRAM2OBF_TXFR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDSH</name>
              <description>Read Data Section Host
1 = Data section selected for transfer from Message RAM to Output Buffer
0 = Data section is not read</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_SECTION_NOT_READ</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_SECTION_FOR_MSRAM2OBF_TXFR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OBCR</name>
          <description>Output Buffer Command Request</description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F837F</resetMask>
          <fields>
            <field>
              <name>OBRS</name>
              <description>Output Buffer Request Shadow
Number of source message buffer to be transferred from the Message RAM to OBF Shadow.
Valid values are 0x00 to 0x7F (0...127). If the number of the first message buffer of the receive
FIFO is written to this register the Message Handler transfers the message buffer addressed by
the GET Index (GIDX, see [01]Section 5.10 FIFO Function) to OBF Shadow.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VIEW</name>
              <description>View Shadow Buffer
Toggles between OBF Shadow and OBF Host. Only writeable while OBSYS = '0'.
1 = Swap OBF Shadow and OBF Host
0 = No action</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWP_OBFS_AND_OBFH</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQ</name>
              <description>Request Message RAM Transfer
Requests transfer of message buffer addressed by OBRS[6:0] from Message RAM to OBF
Shadow. Only writeable while OBSYS = '0'.
1 = Transfer to OBF Shadow requested
0 = No request</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFR_TO_OBFS_REQ</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBSYS</name>
              <description>Output Buffer Busy Shadow
Set to '1' after setting bit REQ. When the transfer between the Message RAM and OBF
Shadow has completed, OBSYS is set back to '0'.
1 = Transfer between Message RAM and OBF Shadow in progress
0 = No transfer in progress</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TXFR_IN_PROGRESS</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFR_BTW_MSRAM_AND_OBFS</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBRH</name>
              <description>Output Buffer Request Host
Number of message buffer currently accessible by the Host via RDHS[1...3], MBS, and
RDDS[1...64]. By writing VIEW to '1' OBF Shadow and OBF Host are swapped and the transferred
message buffer is accessible by the Host. Valid values are 0x00 to 0x7F (0...127).</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRHS1_MIR2</name>
          <description>Write Header Section 1 (2nd mirror)</description>
          <addressOffset>0xBF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F7F07FF</resetMask>
          <fields>
            <field>
              <name>FID</name>
              <description>Frame ID
Frame ID of the selected message buffer. The frame ID defines the slot number for transmission
reception of the respective message. Message buffers with frame ID = '0' are considered as
not valid.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYC</name>
              <description>Cycle Code
The 7-bit cycle code determines the cycle set used for cycle counter filtering. For details about
the configuration of the cycle code see [01]Section 5.7.2 Cycle Counter Filtering.
CHA, CHB Channel Filter Control
The 2-bit channel filtering field associated with each buffer serves as a filter for receive buffers,
and as a control field for transmit buffers.
CHA CHB.
Transmit Buffer
transmit frame on
Receive Buffer
store frame received from
1 1 both channels
static segment only)
channel A or B
store first semantically valid frame,
static segment only)
1 0 channel A channel A
0 1 channel B channel B
0 0 no transmission ignore frame</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHA</name>
              <description>Channel Filter Control A
The 2-bit channel filtering field associated with each buffer serves as a filter for receive buffers,
and as a control field for transmit buffers.
 









