RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
        <register>
          <name>RDHS3_MIR2</name>
          <description>Read Header Section 3 (2nd mirror)</description>
          <addressOffset>0xDF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3F07FF</resetMask>
          <fields>
            <field>
              <name>DP</name>
              <description>Data Pointer
Pointer to the first 32-bit word of the data section of the addressed message buffer in the Message
RAM.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCC</name>
              <description>Receive Cycle Count (vRF!Header!CycleCount)
Cycle counter value updated from received data frame.</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCI</name>
              <description>Received on Channel Indicator (vSS!Channel)
Indicates the channel from which the received data frame was taken to update the respective
receive buffer.
1 = Frame received on channel A
0 = Frame received on channel B</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFI</name>
              <description>Startup Frame Indicator (vRF!Header!SuFIndicator)
A startup frame is marked by the startup frame indicator.
1 = The received frame is a startup frame
0 = The received frame is not a startup frame</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXD_FRAME_NOT_STARTUP_FRAME</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXD_FRAME_STARTUP_FRAME</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYN</name>
              <description>Sync Frame Indicator (vRF!Header!SyFIndicator)
A sync frame is marked by the sync frame indicator.
1 = The received frame is a sync frame
0 = The received frame is not a sync frame</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXD_FRAME_NOT_SYNC_FRAME</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXD_FRAME_SYNC_FRAME</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NFI</name>
              <description>Null Frame Indicator (vRF!Header!NFIndicator)
Is set to '1' after storage of the first received data frame.
1 = At least one data frame has been stored into the respective message buffer
0 = Up to now no data frame has been stored into the respective message buffer</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FRAME_NOT_STORED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_FRAME_STORED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPI</name>
              <description>Payload Preamble Indicator (vRF!Header!PPIndicator)
The payload preamble indicator defines whether a network management vector or message ID is
contained within the payload segment of the received frame.
1 = Static segment: Network management vector in the first part of the payload
Dynamic segment:Message ID in the first part of the payload
0 = The payload segment of the received frame does not contain a network management vector
nor a message ID</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_HAS_NO_NMV_MID</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_WITH_NMV_MID</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES</name>
              <description>N/A</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBS_MIR2</name>
          <description>Message Buffer Status  (2nd mirror)</description>
          <addressOffset>0xDFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3FDFFF</resetMask>
          <fields>
            <field>
              <name>VFRA</name>
              <description>Valid Frame Received on Channel A (vSS!ValidFrameA)
A valid frame indication is set if a valid frame was received on channel A.
1 = Valid frame received on channel A
0 = No valid frame received on channel A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_NO_VALID_FRAME</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_WITH_VALID_FRAME</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VFRB</name>
              <description>Valid Frame Received on Channel B (vSS!ValidFrameB)
A valid frame indication is set if a valid frame was received on channel B.
1 = Valid frame received on channel B
0 = No valid frame received on channel B</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_NO_VALID_FRAME</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_WITH_VALID_FRAME</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEOA</name>
              <description>Syntax Error Observed on Channel A (vSS!SyntaxErrorA)
A syntax error was observed in the assigned slot on channel A.
1 = Syntax error observed on channel A
0 = No syntax error observed on channel A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_NO_SYNTAX_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_HAS_SYNTAX_ERROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEOB</name>
              <description>Syntax Error Observed on Channel B (vSS!SyntaxErrorB)
A syntax error was observed in the assigned slot on channel B.
1 = Syntax error observed on channel B
0 = No syntax error observed on channel B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_NO_SYNTAX_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_HAS_SYNTAX_ERROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEOA</name>
              <description>Content Error Observed on Channel A (vSS!ContentErrorA)
A content error was observed in the assigned slot on channel A.
1 = Content error observed on channel A
0 = No content error observed on channel A</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_NO_CONTENT_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_HAS_CONTENT_ERROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEOB</name>
              <description>Content Error Observed on Channel B (vSS!ContentErrorB)
A content error was observed in the assigned slot on channel B.
1 = Content error observed on channel B
0 = No content error observed on channel B</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_NO_CONTENT_ERROR</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_HAS_CONTENT_ERROR</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVOA</name>
              <description>Slot Boundary Violation Observed on Channel A (vSS!BViolationA)
A slot boundary violation (channel active at the start or at the end of the assigned slot) was
observed on channel A.
1 = Slot boundary violation observed on channel A
0 = No slot boundary violation observed on channel A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_NO_SLOT_BNDRY_VIOLATION</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_HAS_SLOT_BNDRY_VIOLATION</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVOB</name>
              <description>Slot Boundary Violation Observed on Channel B (vSS!BViolationB)
A slot boundary violation (channel active at the start or at the end of the assigned slot) was
observed on channel B.
1 = Slot boundary violation observed on channel B
0 = No slot boundary violation observed on channel B</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_NO_SLOT_BNDRY_VIOLATION</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_HAS_SLOT_BNDRY_VIOLATION</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCIA</name>
              <description>Transmission Conflict Indication Channel A (vSS!TxConflictA)
A transmission conflict indication is set if a transmission conflict has occurred on channel A.
1 = Transmission conflict occurred on channel A
0 = No transmission conflict occurred on channel A</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_NO_TXMN_CONFLICT</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_HAS_TXMN_CONFLICT</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCIB</name>
              <description>Transmission Conflict Indication Channel B (vSS!TxConflictB)
A transmission conflict indication is set if a transmission conflict has occurred on channel B.
1 = Transmission conflict occurred on channel B
0 = No transmission conflict occurred on channel B</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_NO_TXMN_CONFLICT</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_HAS_TXMN_CONFLICT</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESA</name>
              <description>Empty Slot Channel A
In an empty slot there is no activity detected on the bus. The condition is checked in static and
dynamic slots.
1 = No bus activity detected in the assigned slot on channel A
0 = Bus activity detected in the assigned slot on channel A</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_A_HAS_BUS_ACTIVITY</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_NO_BUS_ACTIVITY</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESB</name>
              <description>Empty Slot Channel B
In an empty slot there is no activity detected on the bus. The condition is checked in static and
dynamic slots.
1 = No bus activity detected in the assigned slot on channel B
0 = Bus activity detected in the assigned slot on channel B</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_HAS_BUS_ACTIVITY</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_B_NO_BUS_ACTIVITY</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MLST</name>
              <description>Message Lost
The flag is set in case the Host did not read the message before the message buffer was updated
from a received data frame. Not affected by reception of null frames except for message buffers
belonging to the receive FIFO. The flag is reset by a Host write to the message buffer via IBF or
when a new message is stored into the message buffer after the message buffers ND flag was
reset by reading out the message buffer via OBF.
1 = Unprocessed message was overwritten
0 = No message lost</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MSG_LOST</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_LOST</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTA</name>
              <description>Frame Transmitted on Channel A
Indicates that this node has transmitted a data frame in the configured slot on channel A.
1 = Data frame transmitted on channel A
0 = No data frame transmitted on channel A</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FRAME_NOT_TXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_FRAME_TXD_ON_CH_A</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTB</name>
              <description>Frame Transmitted on Channel B
Indicates that this node has transmitted a data frame in the configured slot on channel B.
1 = Data frame transmitted on channel B
0 = No data frame transmitted on channel B</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FRAME_NOT_TXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_FRAME_TXD_ON_CH_B</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCS</name>
              <description>Cycle Count Status
Actual cycle count when status was updated.
For receive buffers (CFG = '0') the following status bits are updated from both valid data and null
frames. If no valid frame was received, the previous value is maintained. For transmit buffers the flags
have no meaning and should be ignored.</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCIS</name>
              <description>Received on Channel Indicator Status (vSS!Channel)
Indicates the channel on which the frame was received.
1 = Frame received on channel A
0 = Frame received on channel B</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFIS</name>
              <description>Startup Frame Indicator Status (vRF!Header!SuFIndicator)
A startup frame is marked by the startup frame indicator.
1 = The received frame is a startup frame
0 = No startup frame received</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_STARTUP_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STARTUP_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNS</name>
              <description>Sync Frame Indicator Status (vRF!Header!SyFIndicator)
A sync frame is marked by the sync frame indicator.
1 = The received frame is a sync frame
0 = No sync frame received</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SYNC_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NFIS</name>
              <description>Null Frame Indicator Status (vRF!Header!NFIndicator)
If set to '0' the payload segment of the received frame contains no usable data.
1 = Received frame is not a null frame
0 = Received frame is a null frame</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NULL_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_NULL_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
