RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c8m.svd
              </enumeratedValues>
            </field>
            <field>
              <name>PPIS</name>
              <description>Payload Preamble Indicator Status (vRF!Header!PPIndicator)
The payload preamble indicator defines whether a network management vector or message ID is
contained within the payload segment of the received frame.
1 = Static segment: Network management vector at the beginning of the payload
Dynamic segment: Message ID at the beginning of the payload
0 = The payload segment of the received frame does not contain a network management vector
or a message ID</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_HAS_NO_NMV_MID</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_WITH_NMV_MID</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESS</name>
              <description>N/A</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>4</dimIncrement>
          <name>RDDS_MIR[%s]</name>
          <description>Read Data Section [1...64] (mirror)</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MD</name>
              <description>Message Data
MD[7:0] = DW2n-1, byte4n-4
MD[15:8] = DW2n-1, byte4n-3
MD[23:16] = DW2n, byte4n-2
MD[31:24] = DW2n, byte4n-1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHS1_MIR</name>
          <description>Read Header Section 1 (mirror)</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F7F07FF</resetMask>
          <fields>
            <field>
              <name>FID</name>
              <description>Frame ID</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CYC</name>
              <description>Cycle Code</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHA</name>
              <description>Channel Filter Control A</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CHB</name>
              <description>Channel Filter Control B</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Message Buffer Direction Configuration Bit</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PPIT</name>
              <description>Payload Preamble Indicator Transmit</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXM</name>
              <description>Transmission Mode</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MBI</name>
              <description>Message Buffer Interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHS2_MIR</name>
          <description>Read Header Section 2 (mirror)</description>
          <addressOffset>0xF04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F7F07FF</resetMask>
          <fields>
            <field>
              <name>CRC</name>
              <description>Header CRC (vRF!Header!HeaderCRC)
Receive Buffer: Header CRC updated from received data frames
Transmit Buffer: Header CRC calculated and configured by the Host</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLC</name>
              <description>Payload Length Configured
Length of data section (number of 2-byte words) as configured by the Host.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLR</name>
              <description>Payload Length Received (vRF!Header!Length)
Payload length value updated from received data frames (exception: if message buffer belongs
to the receive FIFO PLR[6:0] is also updated from received null frames)
When a message is stored into a message buffer the following behaviour with respect to payload
length received and payload length configured is implemented:
PLR[6:0] &gt; PLC[6:0]: The payload data stored in the message buffer is truncated to the payload
length configured if PLC[6:0] even or else truncated to PLC[6:0] + 1.
PLR[6:0] &lt;= PLC[6:0]: The received payload data is stored into the message buffers data section.
The remaining data bytes of the data section as configured by PLC[6:0]
are filled with undefined data
PLR[6:0] = zero: The message buffer's data section is filled with undefined data
PLC[6:0] = zero: Message buffer has no data section configured. No data is stored into the
message buffer's data section.</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHS3_MIR</name>
          <description>Read Header Section 3 (mirror)</description>
          <addressOffset>0xF08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3F07FF</resetMask>
          <fields>
            <field>
              <name>DP</name>
              <description>Data Pointer
Pointer to the first 32-bit word of the data section of the addressed message buffer in the Message
RAM.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCC</name>
              <description>Receive Cycle Count (vRF!Header!CycleCount)
Cycle counter value updated from received data frame.</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RCI</name>
              <description>Received on Channel Indicator (vSS!Channel)
Indicates the channel from which the received data frame was taken to update the respective
receive buffer.
1 = Frame received on channel A
0 = Frame received on channel B</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_B_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_A_FRAME_RECEIVED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFI</name>
              <description>Startup Frame Indicator (vRF!Header!SuFIndicator)
A startup frame is marked by the startup frame indicator.
1 = The received frame is a startup frame
0 = The received frame is not a startup frame</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXD_FRAME_NOT_STARTUP_FRAME</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXD_FRAME_STARTUP_FRAME</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYN</name>
              <description>Sync Frame Indicator (vRF!Header!SyFIndicator)
A sync frame is marked by the sync frame indicator.
1 = The received frame is a sync frame
0 = The received frame is not a sync frame</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXD_FRAME_NOT_SYNC_FRAME</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXD_FRAME_SYNC_FRAME</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NFI</name>
              <description>Null Frame Indicator (vRF!Header!NFIndicator)
Is set to '1' after storage of the first received data frame.
1 = At least one data frame has been stored into the respective message buffer
0 = Up to now no data frame has been stored into the respective message buffer</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FRAME_NOT_STORED</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_FRAME_STORED</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPI</name>
              <description>Payload Preamble Indicator (vRF!Header!PPIndicator)
The payload preamble indicator defines whether a network management vector or message ID is
contained within the payload segment of the received frame.
1 = Static segment: Network management vector in the first part of the payload
Dynamic segment:Message ID in the first part of the payload
0 = The payload segment of the received frame does not contain a network management vector
nor a message ID</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_HAS_NO_NMV_MID</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_SEGMENT_WITH_NMV_MID</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RES</name>
              <description>N/A</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
